#ifndef UE4SS_SDK_ABF_NarrativeNPC_AnimBP_HPP
#define UE4SS_SDK_ABF_NarrativeNPC_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_214;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_215;                                                         // 0x000C (size: 0x8)
    int32 __IntProperty_216;                                                          // 0x0014 (size: 0x4)
    FName __NameProperty_217;                                                         // 0x0018 (size: 0x8)
    int32 __IntProperty_218;                                                          // 0x0020 (size: 0x4)
    class UBlendProfile* __BlendProfile_219;                                          // 0x0028 (size: 0x8)
    class UCurveFloat* __CurveFloat_220;                                              // 0x0030 (size: 0x8)
    EAlphaBlendOption __EnumProperty_221;                                             // 0x0038 (size: 0x1)
    EBlendListTransitionType __EnumProperty_222;                                      // 0x0039 (size: 0x1)
    TArray<float> __ArrayProperty_223;                                                // 0x0040 (size: 0x10)
    FName __NameProperty_224;                                                         // 0x0050 (size: 0x8)
    int32 __IntProperty_225;                                                          // 0x0058 (size: 0x4)
    bool __BoolProperty_226;                                                          // 0x005C (size: 0x1)
    float __FloatProperty_227;                                                        // 0x0060 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_228;                               // 0x0064 (size: 0x2C)
    float __FloatProperty_229;                                                        // 0x0090 (size: 0x4)
    bool __BoolProperty_230;                                                          // 0x0094 (size: 0x1)
    EAnimSyncMethod __EnumProperty_231;                                               // 0x0095 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_232;                             // 0x0096 (size: 0x1)
    FName __NameProperty_233;                                                         // 0x0098 (size: 0x8)
    FName __NameProperty_234;                                                         // 0x00A0 (size: 0x8)
    int32 __IntProperty_235;                                                          // 0x00A8 (size: 0x4)
    FName __NameProperty_236;                                                         // 0x00AC (size: 0x8)
    FName __NameProperty_237;                                                         // 0x00B4 (size: 0x8)
    int32 __IntProperty_238;                                                          // 0x00BC (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_239;                                        // 0x00C0 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00E0 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0160 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0178 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x01A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x01D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0208 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0238 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x0268 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x0298 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x02C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x02F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x0328 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x0358 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x0388 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x03B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x03E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x0418 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x0448 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x0478 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x04A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x04D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0508 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0538 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x0568 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive; // 0x0598 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x05C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x05F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;     // 0x0628 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x0658 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x0688 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x06B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x06E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0718 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0748 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0778 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x07A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x07D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0808 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt;                 // 0x0838 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x0868 (size: 0x30)

}; // Size: 0x898

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    float __FloatProperty_0;                                                          // 0x0004 (size: 0x4)
    bool __BoolProperty_1;                                                            // 0x0008 (size: 0x1)
    float __FloatProperty_2;                                                          // 0x000C (size: 0x4)

}; // Size: 0x10

class UABF_NarrativeNPC_AnimBP_C : public UAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x10)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0388 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0390 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0398 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x03B8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0400 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0448 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x04C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x04F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0518 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0540 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0568 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0590 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x05B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x05E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0608 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0630 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0658 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x0680 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x06C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x06E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x0730 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x0750 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0798 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x07E0 (size: 0xF0)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x08D0 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x09A0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x09E8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x0A30 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x0AA0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x0AE8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x0B58 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x0B78 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x0BC0 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x0BE0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x0C00 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x0CC8 (size: 0x48)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x0D10 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x0D30 (size: 0x20)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x0D50 (size: 0x250)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x0FA0 (size: 0x128)
    double Time;                                                                      // 0x10C8 (size: 0x8)
    bool Is DBNO;                                                                     // 0x10D0 (size: 0x1)
    bool Is Dead;                                                                     // 0x10D1 (size: 0x1)
    double Speed;                                                                     // 0x10D8 (size: 0x8)
    bool Is Sleeping;                                                                 // 0x10E0 (size: 0x1)
    bool IsSittingInSeat;                                                             // 0x10E1 (size: 0x1)
    bool Is Viewing Wristwatch;                                                       // 0x10E2 (size: 0x1)
    bool IsCrouching;                                                                 // 0x10E3 (size: 0x1)
    bool IsUsingTerminal;                                                             // 0x10E4 (size: 0x1)
    bool Unarmed;                                                                     // 0x10E5 (size: 0x1)
    class UAimOffsetBlendSpace* AimSpace_UpperBody;                                   // 0x10E8 (size: 0x8)
    class UAnimSequence* AimSpace_BasePose;                                           // 0x10F0 (size: 0x8)
    bool RecentlyPunched;                                                             // 0x10F8 (size: 0x1)
    bool RightFootLast;                                                               // 0x10F9 (size: 0x1)
    bool IsSprinting;                                                                 // 0x10FA (size: 0x1)
    double Yaw;                                                                       // 0x1100 (size: 0x8)
    double Pitch;                                                                     // 0x1108 (size: 0x8)
    FVector LookAtLocation;                                                           // 0x1110 (size: 0x18)
    float SpeakingAlpha;                                                              // 0x1128 (size: 0x4)
    FRotator SpeakingJawMax;                                                          // 0x1130 (size: 0x18)
    class UAnimSequence* Idle Animation;                                              // 0x1148 (size: 0x8)
    bool OverrideIdleState;                                                           // 0x1150 (size: 0x1)
    double HeadLookAlpha;                                                             // 0x1158 (size: 0x8)
    float FootfallTraceDistance;                                                      // 0x1160 (size: 0x4)
    class UAnimSequenceBase* AdditiveAnimation;                                       // 0x1168 (size: 0x8)
    double AdditiveAlpha;                                                             // 0x1170 (size: 0x8)
    float UpperBodyBlend;                                                             // 0x1178 (size: 0x4)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_8266F069477141B5067C679A81041C1A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_297C66A64AB42444122799BCBE3A923A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_3F0D221F4AB23CB6AFAD4F83FB730515();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_D8A9D0854535335612A6D594E9A9BF8D();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void AnimNotify_Footfall_Left();
    void AnimNotify_Footfall_Right();
    void ExecuteUbergraph_ABF_NarrativeNPC_AnimBP(int32 EntryPoint);
}; // Size: 0x117C

#endif
