#ifndef UE4SS_SDK_ABF_NarrativeNPC_AnimBP_HPP
#define UE4SS_SDK_ABF_NarrativeNPC_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_198;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_199;                                                         // 0x000C (size: 0x8)
    int32 __IntProperty_200;                                                          // 0x0014 (size: 0x4)
    FName __NameProperty_201;                                                         // 0x0018 (size: 0x8)
    int32 __IntProperty_202;                                                          // 0x0020 (size: 0x4)
    class UBlendProfile* __BlendProfile_203;                                          // 0x0028 (size: 0x8)
    class UCurveFloat* __CurveFloat_204;                                              // 0x0030 (size: 0x8)
    EAlphaBlendOption __EnumProperty_205;                                             // 0x0038 (size: 0x1)
    EBlendListTransitionType __EnumProperty_206;                                      // 0x0039 (size: 0x1)
    TArray<float> __ArrayProperty_207;                                                // 0x0040 (size: 0x10)
    FName __NameProperty_208;                                                         // 0x0050 (size: 0x8)
    int32 __IntProperty_209;                                                          // 0x0058 (size: 0x4)
    bool __BoolProperty_210;                                                          // 0x005C (size: 0x1)
    float __FloatProperty_211;                                                        // 0x0060 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_212;                               // 0x0064 (size: 0x2C)
    float __FloatProperty_213;                                                        // 0x0090 (size: 0x4)
    bool __BoolProperty_214;                                                          // 0x0094 (size: 0x1)
    EAnimSyncMethod __EnumProperty_215;                                               // 0x0095 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_216;                             // 0x0096 (size: 0x1)
    FName __NameProperty_217;                                                         // 0x0098 (size: 0x8)
    FName __NameProperty_218;                                                         // 0x00A0 (size: 0x8)
    int32 __IntProperty_219;                                                          // 0x00A8 (size: 0x4)
    FName __NameProperty_220;                                                         // 0x00AC (size: 0x8)
    FName __NameProperty_221;                                                         // 0x00B4 (size: 0x8)
    int32 __IntProperty_222;                                                          // 0x00BC (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_223;                                        // 0x00C0 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00E0 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0160 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0178 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x01A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x01D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0208 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0238 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x0268 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x0298 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x02C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x02F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x0328 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x0358 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x0388 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x03B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x03E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x0418 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x0448 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x0478 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x04A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x04D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive; // 0x0508 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0538 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0568 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x0598 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;     // 0x05C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x05F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x0628 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x0658 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0688 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x06B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x06E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0718 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0748 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x0778 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x07A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt;                 // 0x07D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x0808 (size: 0x30)

}; // Size: 0x838

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    float __FloatProperty_0;                                                          // 0x0004 (size: 0x4)
    bool __BoolProperty_1;                                                            // 0x0008 (size: 0x1)
    float __FloatProperty_2;                                                          // 0x000C (size: 0x4)

}; // Size: 0x10

class UABF_NarrativeNPC_AnimBP_C : public UAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x10)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0388 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0390 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0398 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x03B8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0400 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0448 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x04C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x04F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0518 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0540 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0568 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0590 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x05B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x05E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0608 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0630 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0658 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0680 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x06C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x06E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x0730 (size: 0x20)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x0750 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0820 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0868 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x08B0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x08F8 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x0968 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x09B0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x0A20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x0A40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x0A88 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x0AA8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x0AC8 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x0B90 (size: 0x48)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x0BD8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x0BF8 (size: 0x20)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x0C20 (size: 0x250)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x0E70 (size: 0x128)
    double Time;                                                                      // 0x0F98 (size: 0x8)
    bool Is DBNO;                                                                     // 0x0FA0 (size: 0x1)
    bool Is Dead;                                                                     // 0x0FA1 (size: 0x1)
    double Speed;                                                                     // 0x0FA8 (size: 0x8)
    bool Is Sleeping;                                                                 // 0x0FB0 (size: 0x1)
    bool IsSittingInSeat;                                                             // 0x0FB1 (size: 0x1)
    bool Is Viewing Wristwatch;                                                       // 0x0FB2 (size: 0x1)
    bool IsCrouching;                                                                 // 0x0FB3 (size: 0x1)
    bool IsUsingTerminal;                                                             // 0x0FB4 (size: 0x1)
    bool Unarmed;                                                                     // 0x0FB5 (size: 0x1)
    class UAimOffsetBlendSpace* AimSpace_UpperBody;                                   // 0x0FB8 (size: 0x8)
    class UAnimSequence* AimSpace_BasePose;                                           // 0x0FC0 (size: 0x8)
    bool RecentlyPunched;                                                             // 0x0FC8 (size: 0x1)
    bool RightFootLast;                                                               // 0x0FC9 (size: 0x1)
    bool IsSprinting;                                                                 // 0x0FCA (size: 0x1)
    double Yaw;                                                                       // 0x0FD0 (size: 0x8)
    double Pitch;                                                                     // 0x0FD8 (size: 0x8)
    FVector LookAtLocation;                                                           // 0x0FE0 (size: 0x18)
    float SpeakingAlpha;                                                              // 0x0FF8 (size: 0x4)
    FRotator SpeakingJawMax;                                                          // 0x1000 (size: 0x18)
    class UAnimSequence* Idle Animation;                                              // 0x1018 (size: 0x8)
    bool OverrideIdleState;                                                           // 0x1020 (size: 0x1)
    double HeadLookAlpha;                                                             // 0x1028 (size: 0x8)
    float FootfallTraceDistance;                                                      // 0x1030 (size: 0x4)
    class UAnimSequenceBase* AdditiveAnimation;                                       // 0x1038 (size: 0x8)
    double AdditiveAlpha;                                                             // 0x1040 (size: 0x8)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_8266F069477141B5067C679A81041C1A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_297C66A64AB42444122799BCBE3A923A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_3F0D221F4AB23CB6AFAD4F83FB730515();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_D8A9D0854535335612A6D594E9A9BF8D();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void AnimNotify_Footfall_Left();
    void AnimNotify_Footfall_Right();
    void ExecuteUbergraph_ABF_NarrativeNPC_AnimBP(int32 EntryPoint);
}; // Size: 0x1048

#endif
