#ifndef UE4SS_SDK_ABF_NarrativeNPC_AnimBP_HPP
#define UE4SS_SDK_ABF_NarrativeNPC_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_236;                                                         // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_237;                                                // 0x0010 (size: 0x10)
    FName __NameProperty_238;                                                         // 0x0020 (size: 0x8)
    int32 __IntProperty_239;                                                          // 0x0028 (size: 0x4)
    FName __NameProperty_240;                                                         // 0x002C (size: 0x8)
    int32 __IntProperty_241;                                                          // 0x0034 (size: 0x4)
    class UBlendProfile* __BlendProfile_242;                                          // 0x0038 (size: 0x8)
    class UCurveFloat* __CurveFloat_243;                                              // 0x0040 (size: 0x8)
    EAlphaBlendOption __EnumProperty_244;                                             // 0x0048 (size: 0x1)
    EBlendListTransitionType __EnumProperty_245;                                      // 0x0049 (size: 0x1)
    TArray<float> __ArrayProperty_246;                                                // 0x0050 (size: 0x10)
    FName __NameProperty_247;                                                         // 0x0060 (size: 0x8)
    int32 __IntProperty_248;                                                          // 0x0068 (size: 0x4)
    FName __NameProperty_249;                                                         // 0x006C (size: 0x8)
    int32 __IntProperty_250;                                                          // 0x0074 (size: 0x4)
    FName __NameProperty_251;                                                         // 0x0078 (size: 0x8)
    FName __NameProperty_252;                                                         // 0x0080 (size: 0x8)
    int32 __IntProperty_253;                                                          // 0x0088 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_254;                                        // 0x0090 (size: 0x20)
    bool __BoolProperty_255;                                                          // 0x00B0 (size: 0x1)
    float __FloatProperty_256;                                                        // 0x00B4 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_257;                               // 0x00B8 (size: 0x2C)
    float __FloatProperty_258;                                                        // 0x00E4 (size: 0x4)
    bool __BoolProperty_259;                                                          // 0x00E8 (size: 0x1)
    EAnimSyncMethod __EnumProperty_260;                                               // 0x00E9 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_261;                             // 0x00EA (size: 0x1)
    FName __NameProperty_262;                                                         // 0x00EC (size: 0x8)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00F8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0178 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0190 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_3;                 // 0x01C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x01F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0220 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0250 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x0280 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x02B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x02E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x0310 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x0340 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x0370 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x03A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x03D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x0400 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x0430 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;     // 0x0460 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x0490 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x04C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x04F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x0520 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x0550 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;     // 0x0580 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x05B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive; // 0x05E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0610 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x0640 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x0670 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x06A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x06D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0700 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0730 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0760 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0790 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x07C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x07F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0820 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt;                 // 0x0850 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x0880 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x08B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x08E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0910 (size: 0x30)

}; // Size: 0x940

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    bool __BoolProperty_0;                                                            // 0x0008 (size: 0x1)
    float __FloatProperty_1;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0010 (size: 0x4)
    bool __BoolProperty_3;                                                            // 0x0014 (size: 0x1)
    float __FloatProperty_4;                                                          // 0x0018 (size: 0x4)
    bool __BoolProperty_5;                                                            // 0x001C (size: 0x1)

}; // Size: 0x1D

class UABF_NarrativeNPC_AnimBP_C : public UAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x20)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0398 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03A0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03A8 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x03C8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0410 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0458 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x04D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0500 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0528 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0578 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x05A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x05C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x05F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0668 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x0690 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x0700 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x0748 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x0790 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x07B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x07F8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x0818 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x0888 (size: 0x48)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x08D0 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x09A0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x09E8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x0A30 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x0AA0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x0AE8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0B08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x0B50 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x0B70 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x0B90 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0C58 (size: 0x48)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x0CA0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x0CC0 (size: 0x20)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x0CE0 (size: 0x250)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x0F30 (size: 0x128)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1058 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x10A0 (size: 0xF0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x1190 (size: 0x48)
    double Time;                                                                      // 0x11D8 (size: 0x8)
    bool Is DBNO;                                                                     // 0x11E0 (size: 0x1)
    bool Is Dead;                                                                     // 0x11E1 (size: 0x1)
    double Speed;                                                                     // 0x11E8 (size: 0x8)
    bool Is Sleeping;                                                                 // 0x11F0 (size: 0x1)
    bool IsSittingInSeat;                                                             // 0x11F1 (size: 0x1)
    bool Is Viewing Wristwatch;                                                       // 0x11F2 (size: 0x1)
    bool IsCrouching;                                                                 // 0x11F3 (size: 0x1)
    bool IsUsingTerminal;                                                             // 0x11F4 (size: 0x1)
    bool Unarmed;                                                                     // 0x11F5 (size: 0x1)
    class UAimOffsetBlendSpace* AimSpace_UpperBody;                                   // 0x11F8 (size: 0x8)
    class UAnimSequence* AimSpace_BasePose;                                           // 0x1200 (size: 0x8)
    bool RecentlyPunched;                                                             // 0x1208 (size: 0x1)
    bool RightFootLast;                                                               // 0x1209 (size: 0x1)
    bool IsSprinting;                                                                 // 0x120A (size: 0x1)
    double Yaw;                                                                       // 0x1210 (size: 0x8)
    double Pitch;                                                                     // 0x1218 (size: 0x8)
    FVector LookAtLocation;                                                           // 0x1220 (size: 0x18)
    float SpeakingAlpha;                                                              // 0x1238 (size: 0x4)
    FRotator SpeakingJawMax;                                                          // 0x1240 (size: 0x18)
    class UAnimSequence* Idle Animation;                                              // 0x1258 (size: 0x8)
    bool OverrideIdleState;                                                           // 0x1260 (size: 0x1)
    double HeadLookAlpha;                                                             // 0x1268 (size: 0x8)
    float FootfallTraceDistance;                                                      // 0x1270 (size: 0x4)
    class UAnimSequenceBase* AdditiveAnimation;                                       // 0x1278 (size: 0x8)
    double AdditiveAlpha;                                                             // 0x1280 (size: 0x8)
    float UpperBodyBlend;                                                             // 0x1288 (size: 0x4)
    float Direction;                                                                  // 0x128C (size: 0x4)
    class UBlendSpace* SittingBlendspace;                                             // 0x1290 (size: 0x8)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_8266F069477141B5067C679A81041C1A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_297C66A64AB42444122799BCBE3A923A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_3F0D221F4AB23CB6AFAD4F83FB730515();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_NarrativeNPC_AnimBP_AnimGraphNode_TransitionResult_D8A9D0854535335612A6D594E9A9BF8D();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void AnimNotify_Footfall_Left();
    void AnimNotify_Footfall_Right();
    void BlueprintInitializeAnimation();
    void ExecuteUbergraph_ABF_NarrativeNPC_AnimBP(int32 EntryPoint);
}; // Size: 0x1298

#endif
