#ifndef UE4SS_SDK_ABF_Zombie_AnimBP_HPP
#define UE4SS_SDK_ABF_Zombie_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_214;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_215;                                                         // 0x000C (size: 0x8)
    FName __NameProperty_216;                                                         // 0x0014 (size: 0x8)
    FName __NameProperty_217;                                                         // 0x001C (size: 0x8)
    int32 __IntProperty_218;                                                          // 0x0024 (size: 0x4)
    TArray<float> __ArrayProperty_219;                                                // 0x0028 (size: 0x10)
    TArray<float> __ArrayProperty_220;                                                // 0x0038 (size: 0x10)
    TArray<float> __ArrayProperty_221;                                                // 0x0048 (size: 0x10)
    TArray<float> __ArrayProperty_222;                                                // 0x0058 (size: 0x10)
    FInputScaleBiasClampConstants __StructProperty_223;                               // 0x0068 (size: 0x2C)
    float __FloatProperty_224;                                                        // 0x0094 (size: 0x4)
    class UBlendProfile* __BlendProfile_225;                                          // 0x0098 (size: 0x8)
    class UCurveFloat* __CurveFloat_226;                                              // 0x00A0 (size: 0x8)
    EAlphaBlendOption __EnumProperty_227;                                             // 0x00A8 (size: 0x1)
    EBlendListTransitionType __EnumProperty_228;                                      // 0x00A9 (size: 0x1)
    TArray<float> __ArrayProperty_229;                                                // 0x00B0 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_230;                                        // 0x00C0 (size: 0x20)
    float __FloatProperty_231;                                                        // 0x00E0 (size: 0x4)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_232;                        // 0x00E4 (size: 0x1)
    bool __BoolProperty_233;                                                          // 0x00E5 (size: 0x1)
    int32 __IntProperty_234;                                                          // 0x00E8 (size: 0x4)
    float __FloatProperty_235;                                                        // 0x00EC (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_236;                                  // 0x00F0 (size: 0x8)
    bool __BoolProperty_237;                                                          // 0x00F8 (size: 0x1)
    EAnimSyncMethod __EnumProperty_238;                                               // 0x00F9 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_239;                             // 0x00FA (size: 0x1)
    FName __NameProperty_240;                                                         // 0x00FC (size: 0x8)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0108 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0188 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x01A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x01D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x0200 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x0230 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x0260 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;      // 0x0290 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x02C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x02F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x0320 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0350 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x0380 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x03B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x03E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x0410 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x0440 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0470 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1; // 0x04A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1; // 0x04D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt;                 // 0x0500 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;           // 0x0530 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0560 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0590 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;      // 0x05C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;      // 0x05F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0620 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0650 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot_1;         // 0x0680 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x06B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x06E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x0710 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0740 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x0770 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x07A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x07D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x0800 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot;           // 0x0830 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;      // 0x0860 (size: 0x30)

}; // Size: 0x890

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    float __FloatProperty_0;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_2;                                                          // 0x000C (size: 0x4)
    bool __BoolProperty_3;                                                            // 0x0010 (size: 0x1)
    bool __BoolProperty_4;                                                            // 0x0011 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0012 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0013 (size: 0x1)
    bool __BoolProperty_7;                                                            // 0x0014 (size: 0x1)

}; // Size: 0x15

class UABF_Zombie_AnimBP_C : public UAbioticCharacterAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x18)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0390 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0398 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03A0 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x03C0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0408 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x0450 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x04D0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x04F8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0540 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0568 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x0590 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x0600 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0620 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x0668 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x0688 (size: 0xC8)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x0750 (size: 0x118)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0868 (size: 0xF0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x0958 (size: 0x48)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x09A0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x09C0 (size: 0x20)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x09E0 (size: 0x250)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x0C30 (size: 0x128)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0D58 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x0DD8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x0E00 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x0E48 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0E90 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0ED8 (size: 0x48)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot_1;                              // 0x0F20 (size: 0x90)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x0FB0 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x0FF8 (size: 0x128)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x1120 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x1140 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x1160 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x11A8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x11F0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x1238 (size: 0x48)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot;                                // 0x1280 (size: 0x90)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x1310 (size: 0x40)
    double Time;                                                                      // 0x1350 (size: 0x8)
    bool Is Dead;                                                                     // 0x1358 (size: 0x1)
    double Speed;                                                                     // 0x1360 (size: 0x8)
    bool Unarmed;                                                                     // 0x1368 (size: 0x1)
    class UAimOffsetBlendSpace* AimSpace_UpperBody;                                   // 0x1370 (size: 0x8)
    class UAnimSequence* AimSpace_BasePose;                                           // 0x1378 (size: 0x8)
    bool RecentlyPunched;                                                             // 0x1380 (size: 0x1)
    bool RightFootLast;                                                               // 0x1381 (size: 0x1)
    double Yaw;                                                                       // 0x1388 (size: 0x8)
    double Pitch;                                                                     // 0x1390 (size: 0x8)
    FVector LookAtLocation;                                                           // 0x1398 (size: 0x18)
    float SpeakingAlpha;                                                              // 0x13B0 (size: 0x4)
    FRotator SpeakingJawMax;                                                          // 0x13B8 (size: 0x18)
    float FootfallTraceDistance;                                                      // 0x13D0 (size: 0x4)
    class AAbiotic_Character_ParentBP_C* CharacterParent;                             // 0x13D8 (size: 0x8)
    bool Eating;                                                                      // 0x13E0 (size: 0x1)
    bool Grabbed;                                                                     // 0x13E1 (size: 0x1)
    double HeadExplodedAlpha;                                                         // 0x13E8 (size: 0x8)
    bool IsSprinting;                                                                 // 0x13F0 (size: 0x1)
    bool WasInitiallyDead;                                                            // 0x13F1 (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_Zombie_AnimBP_AnimGraphNode_LookAt_66C351274D5D1EE04727D9AE674C1AAA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_Zombie_AnimBP_AnimGraphNode_LayeredBoneBlend_ADA5A5384C7BDA4DEB4DA5954330C9B3();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void AnimNotify_Footfall_Left();
    void AnimNotify_Footfall_Right();
    void AnimNotify_GrabStart();
    void AnimNotify_GrabEnd();
    void BlueprintInitializeAnimation();
    void ExecuteUbergraph_ABF_Zombie_AnimBP(int32 EntryPoint);
}; // Size: 0x13F2

#endif
