#ifndef UE4SS_SDK_ABF_Zombie_AnimBP_HPP
#define UE4SS_SDK_ABF_Zombie_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_193;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_194;                                                         // 0x000C (size: 0x8)
    int32 __IntProperty_195;                                                          // 0x0014 (size: 0x4)
    FName __NameProperty_196;                                                         // 0x0018 (size: 0x8)
    FName __NameProperty_197;                                                         // 0x0020 (size: 0x8)
    int32 __IntProperty_198;                                                          // 0x0028 (size: 0x4)
    bool __BoolProperty_199;                                                          // 0x002C (size: 0x1)
    TArray<float> __ArrayProperty_200;                                                // 0x0030 (size: 0x10)
    TArray<float> __ArrayProperty_201;                                                // 0x0040 (size: 0x10)
    TArray<float> __ArrayProperty_202;                                                // 0x0050 (size: 0x10)
    TArray<float> __ArrayProperty_203;                                                // 0x0060 (size: 0x10)
    float __FloatProperty_204;                                                        // 0x0070 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_205;                               // 0x0074 (size: 0x2C)
    float __FloatProperty_206;                                                        // 0x00A0 (size: 0x4)
    EAnimSyncMethod __EnumProperty_207;                                               // 0x00A4 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_208;                             // 0x00A5 (size: 0x1)
    FName __NameProperty_209;                                                         // 0x00A8 (size: 0x8)
    FAnimNodeFunctionRef __StructProperty_210;                                        // 0x00B0 (size: 0x20)
    class UBlendProfile* __BlendProfile_211;                                          // 0x00D0 (size: 0x8)
    class UCurveFloat* __CurveFloat_212;                                              // 0x00D8 (size: 0x8)
    bool __BoolProperty_213;                                                          // 0x00E0 (size: 0x1)
    EAlphaBlendOption __EnumProperty_214;                                             // 0x00E1 (size: 0x1)
    EBlendListTransitionType __EnumProperty_215;                                      // 0x00E2 (size: 0x1)
    TArray<float> __ArrayProperty_216;                                                // 0x00E8 (size: 0x10)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00F8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0178 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0190 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x01C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x01F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x0220 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x0250 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x0280 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x02B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x02E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0310 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x0340 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0370 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x03A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x03D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x0400 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0430 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1; // 0x0460 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1; // 0x0490 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt;                 // 0x04C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;           // 0x04F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0520 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0550 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;      // 0x0580 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot_1;         // 0x05B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;      // 0x05E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0610 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0640 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot;           // 0x0670 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x06A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x06D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x0700 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0730 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x0760 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0790 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x07C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x07F0 (size: 0x30)

}; // Size: 0x820

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x000C (size: 0x4)
    bool __BoolProperty_2;                                                            // 0x0010 (size: 0x1)
    bool __BoolProperty_3;                                                            // 0x0011 (size: 0x1)
    bool __BoolProperty_4;                                                            // 0x0012 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0013 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0014 (size: 0x1)

}; // Size: 0x15

class UABF_Zombie_AnimBP_C : public UAbioticCharacterAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x18)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0390 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0398 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03A0 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x03C0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0408 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x0450 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x04D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x04F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0520 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x0548 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x05B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x05D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x0620 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x0640 (size: 0xC8)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x0708 (size: 0x118)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0820 (size: 0xF0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x0910 (size: 0x48)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x0958 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x0978 (size: 0x20)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x09A0 (size: 0x250)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x0BF0 (size: 0x128)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0D18 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x0D98 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x0DC0 (size: 0x48)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot_1;                              // 0x0E08 (size: 0x90)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x0E98 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0EE0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0F28 (size: 0x48)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot;                                // 0x0F70 (size: 0x90)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x1000 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x1048 (size: 0x128)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x1170 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x1190 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x11B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x11F8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1240 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x1288 (size: 0x48)
    double Time;                                                                      // 0x12D0 (size: 0x8)
    bool Is Dead;                                                                     // 0x12D8 (size: 0x1)
    double Speed;                                                                     // 0x12E0 (size: 0x8)
    bool Unarmed;                                                                     // 0x12E8 (size: 0x1)
    class UAimOffsetBlendSpace* AimSpace_UpperBody;                                   // 0x12F0 (size: 0x8)
    class UAnimSequence* AimSpace_BasePose;                                           // 0x12F8 (size: 0x8)
    bool RecentlyPunched;                                                             // 0x1300 (size: 0x1)
    bool RightFootLast;                                                               // 0x1301 (size: 0x1)
    double Yaw;                                                                       // 0x1308 (size: 0x8)
    double Pitch;                                                                     // 0x1310 (size: 0x8)
    FVector LookAtLocation;                                                           // 0x1318 (size: 0x18)
    float SpeakingAlpha;                                                              // 0x1330 (size: 0x4)
    FRotator SpeakingJawMax;                                                          // 0x1338 (size: 0x18)
    float FootfallTraceDistance;                                                      // 0x1350 (size: 0x4)
    class AAbiotic_Character_ParentBP_C* CharacterParent;                             // 0x1358 (size: 0x8)
    bool Eating;                                                                      // 0x1360 (size: 0x1)
    bool Grabbed;                                                                     // 0x1361 (size: 0x1)
    double HeadExplodedAlpha;                                                         // 0x1368 (size: 0x8)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_Zombie_AnimBP_AnimGraphNode_LookAt_66C351274D5D1EE04727D9AE674C1AAA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABF_Zombie_AnimBP_AnimGraphNode_LayeredBoneBlend_ADA5A5384C7BDA4DEB4DA5954330C9B3();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void AnimNotify_Footfall_Left();
    void AnimNotify_Footfall_Right();
    void AnimNotify_GrabStart();
    void AnimNotify_GrabEnd();
    void ExecuteUbergraph_ABF_Zombie_AnimBP(int32 EntryPoint);
}; // Size: 0x1370

#endif
