#ifndef UE4SS_SDK_Abiotic_FPAnimationStruct_HPP
#define UE4SS_SDK_Abiotic_FPAnimationStruct_HPP

struct FAbiotic_FPAnimationStruct
{
    TSoftObjectPtr<UAnimSequence> FPArmsIdle_2_C1E331794D92DB388BCF9092CE72F8F9;      // 0x0000 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> FPArmsWalk_4_2C7CC7094A64D4165F59F9A97BA3A8E4;      // 0x0028 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsUseItem_33_D084BBDE4BE7E032DDD2A59E55717822;   // 0x0050 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsBadReload_32_BFABED5948330096D39E2FBC33415DE8; // 0x0078 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsReload_31_B8E5EC99407C12FB4CB2C3B3259D5900;    // 0x00A0 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsExpertReload_81_3616FFE1417E96B25267D9AC13CDF5F3; // 0x00C8 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsEquip_30_B279A1694C8245C855DDB29C289087AC;     // 0x00F0 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsStow_34_CCE82AFD420344BFF511CBA2EC383D2E;      // 0x0118 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> FPArmsSprintLoop_29_EA01E95D4CC60CB5C5A70EB2F8FDDE86; // 0x0140 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsEnterSprint_35_DE3FE8D040013BCC700DDEA789ED523B; // 0x0168 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsExitSprint_36_B32DD6594107584E9666978C7C39C921; // 0x0190 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> FPArmsCrouchIdle_23_EE7003AA408E7FE1B293059BE94C5E73; // 0x01B8 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> FPArmsCrouchWalk_25_A6387E984B4C4FD2F1327C9FFCC71C47; // 0x01E0 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsCrouchUseItem_78_22F4DABD40102543D3CA78B48D6E283F; // 0x0208 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsWindUp_54_8D591991400C1D37760E89B31FBB9AE5;    // 0x0230 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsSecondaryUse_55_2686DE134FD4548F90D903B30F1AD4EC; // 0x0258 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> FPArmsAimDownSights_57_F6317BC245BB42B1FC507EB83335B6E9; // 0x0280 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> FPArmsADSFire_74_C94B3E7F438E2918D7461E8DC8D8F39B;  // 0x02A8 (size: 0x28)

}; // Size: 0x2D0

#endif
