#ifndef UE4SS_SDK_Abiotic_WeaponAnimationData_Struct_HPP
#define UE4SS_SDK_Abiotic_WeaponAnimationData_Struct_HPP

struct FAbiotic_WeaponAnimationData_Struct
{
    TSoftClassPtr<UAnimInstance> AnimBP_49_EB04FF1D416018B811077D8DEE3389E1;          // 0x0000 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> ItemIdleLoop_11_927C96614C5023D9E63F30AB4C950E2F;   // 0x0028 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> ItemWalkLoop_55_DA3395CC40C473060F1B8AA3ACE125D4;   // 0x0050 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> ItemSprintLoop_52_DED1AD284239874936476A8AEF7E531A; // 0x0078 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemUse_13_19EF30D74C1A365C3169699C04CF9CCB;         // 0x00A0 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemUseSecondary_26_37E123A747A9759C5BA2E4B48B15B54D; // 0x00C8 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemBadReload_24_E180C13A4E42CCB370EA948AE92FFAC2;   // 0x00F0 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemReload_21_010AFA8A4D6CC253501150871A11533B;      // 0x0118 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemExpertReload_58_7F7433E444EF2EC08A66F28F1B02843A; // 0x0140 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemWindup_25_A8F4BA1442736EB2CF905198F43F6E1A;      // 0x0168 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> ItemAimDownSightsLoop_29_8D28FA74433A19B765F013B4ACC5D7C6; // 0x0190 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemAimDownSightsFire_30_4B3242484579357414C67B958234CC53; // 0x01B8 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemSpecial01_37_6DCC094847C4B921266167A8CC8C1BD5;   // 0x01E0 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemSpecial02_40_626F0DF14BFEA9EA058315B0D535E726;   // 0x0208 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemFidget01_41_EF3421BE4EDF685FCDCCAFB08AEAB92F;    // 0x0230 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemFidget02_42_58E7A00141AB8093206F66B14E149AD6;    // 0x0258 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemEquip_45_AABDECDE4E6B3F3912D6AD832ACE7A32;       // 0x0280 (size: 0x28)

}; // Size: 0x2A8

#endif
