#ifndef UE4SS_SDK_Abiotic_NPCDialogStruct_HPP
#define UE4SS_SDK_Abiotic_NPCDialogStruct_HPP

struct FAbiotic_NPCDialogStruct
{
    TArray<TSoftObjectPtr<USoundBase>> BreathingLoop_47_AC5DD70841AD042D5AFA3ABF1BCD948B; // 0x0000 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> IdleLines_48_19780A604E56120D57FDAD8D24D0ABA7; // 0x0010 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> AggroLines_49_AF5D5F464C621E3163B33C95C8590828; // 0x0020 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> LostTargetLines_50_9D29DC0942A9B36F68C582980D913572; // 0x0030 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> SearchingForTargetLines_52_E59CC1E14F6D9BAA35C8E9A5C9A25DAC; // 0x0040 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> AngstLines_53_8D545AE4408D364E9132459DEA7CB1BD; // 0x0050 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> PainSounds_55_2DE75CDA456F8B76DED31FA0A2325D12; // 0x0060 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> NormalDeathSounds_54_9B419A8F47F4F5497E6135A0880A581F; // 0x0070 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> ScreamingDeathSounds_56_D8100BA446DBCDF0146C7390965415B8; // 0x0080 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> MeleeAttackGrunt_57_5A0BEDB1425CA68B3AB43DAE100E1835; // 0x0090 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> GenericAttackingLines_58_CDF4CE9A4328CB7F7AAA218ABD3ADF8D; // 0x00A0 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> StartleLines_59_21AA4BBE4365731EC60203B17916F32F; // 0x00B0 (size: 0x10)
    TArray<TSoftObjectPtr<USoundBase>> ReloadingLines_64_936B2AFC4570D3CF301962975C97D2BE; // 0x00C0 (size: 0x10)

}; // Size: 0xD0

#endif
