#ifndef UE4SS_SDK_Abiotic_FPAnimationStruct_HPP
#define UE4SS_SDK_Abiotic_FPAnimationStruct_HPP

struct FAbiotic_FPAnimationStruct
{
    class UAnimSequence* FPArmsIdle_82_C1E331794D92DB388BCF9092CE72F8F9;              // 0x0000 (size: 0x8)
    class UAnimSequence* FPArmsWalk_83_2C7CC7094A64D4165F59F9A97BA3A8E4;              // 0x0008 (size: 0x8)
    class UAnimMontage* FPArmsUseItem_84_D084BBDE4BE7E032DDD2A59E55717822;            // 0x0010 (size: 0x8)
    class UAnimMontage* FPArmsBadReload_85_BFABED5948330096D39E2FBC33415DE8;          // 0x0018 (size: 0x8)
    class UAnimMontage* FPArmsReload_86_B8E5EC99407C12FB4CB2C3B3259D5900;             // 0x0020 (size: 0x8)
    class UAnimMontage* FPArmsExpertReload_87_3616FFE1417E96B25267D9AC13CDF5F3;       // 0x0028 (size: 0x8)
    class UAnimMontage* FPArmsEquip_88_B279A1694C8245C855DDB29C289087AC;              // 0x0030 (size: 0x8)
    class UAnimMontage* FPArmsStow_89_CCE82AFD420344BFF511CBA2EC383D2E;               // 0x0038 (size: 0x8)
    class UAnimSequence* FPArmsSprintLoop_90_EA01E95D4CC60CB5C5A70EB2F8FDDE86;        // 0x0040 (size: 0x8)
    class UAnimMontage* FPArmsEnterSprint_91_DE3FE8D040013BCC700DDEA789ED523B;        // 0x0048 (size: 0x8)
    class UAnimMontage* FPArmsExitSprint_92_B32DD6594107584E9666978C7C39C921;         // 0x0050 (size: 0x8)
    class UAnimSequence* FPArmsCrouchIdle_93_EE7003AA408E7FE1B293059BE94C5E73;        // 0x0058 (size: 0x8)
    class UAnimSequence* FPArmsCrouchWalk_94_A6387E984B4C4FD2F1327C9FFCC71C47;        // 0x0060 (size: 0x8)
    class UAnimMontage* FPArmsCrouchUseItem_95_22F4DABD40102543D3CA78B48D6E283F;      // 0x0068 (size: 0x8)
    class UAnimMontage* FPArmsWindUp_96_8D591991400C1D37760E89B31FBB9AE5;             // 0x0070 (size: 0x8)
    class UAnimMontage* FPArmsSecondaryUse_97_2686DE134FD4548F90D903B30F1AD4EC;       // 0x0078 (size: 0x8)
    class UAnimMontage* FPArmsAimDownSights_98_F6317BC245BB42B1FC507EB83335B6E9;      // 0x0080 (size: 0x8)
    class UAnimSequence* FPArmsADSFire_99_C94B3E7F438E2918D7461E8DC8D8F39B;           // 0x0088 (size: 0x8)

}; // Size: 0x90

#endif
