#ifndef UE4SS_SDK_CharacterStatsSave_Struct_HPP
#define UE4SS_SDK_CharacterStatsSave_Struct_HPP

struct FCharacterStatsSave_Struct
{
    double Hunger_2_A6C5CC6E41993323B119FA9E0B3894CA;                                 // 0x0000 (size: 0x8)
    double Thirst_7_E620D3DA44520EAC8EBFA28ECD77E6DA;                                 // 0x0008 (size: 0x8)
    double Sanity_8_1EA1DBDE4CEA799B882ABBB9EF766161;                                 // 0x0010 (size: 0x8)
    double Fatigue_9_D4A267F046B9CD6F07518AAF88356DBE;                                // 0x0018 (size: 0x8)
    double Continence_11_29DC4A474C89E8B517691D8C627AA2F9;                            // 0x0020 (size: 0x8)
    double IncomingContinence_12_5039F95247EC6EF9D0C04681AD1C484B;                    // 0x0028 (size: 0x8)
    double Radiation_16_CBCAFEC549FC3D10D8D4418FD3D5FB77;                             // 0x0030 (size: 0x8)
    double BodyTemperature_15_B87CC427429084EE2405CA9F8B5AFB40;                       // 0x0038 (size: 0x8)

}; // Size: 0x40

#endif
