#ifndef UE4SS_SDK_Exor_AnimBP_HPP
#define UE4SS_SDK_Exor_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_136;                                                         // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_137;                                                // 0x0010 (size: 0x10)
    TArray<float> __ArrayProperty_138;                                                // 0x0020 (size: 0x10)
    TArray<float> __ArrayProperty_139;                                                // 0x0030 (size: 0x10)
    TArray<float> __ArrayProperty_140;                                                // 0x0040 (size: 0x10)
    bool __BoolProperty_141;                                                          // 0x0050 (size: 0x1)
    float __FloatProperty_142;                                                        // 0x0054 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_143;                               // 0x0058 (size: 0x2C)
    float __FloatProperty_144;                                                        // 0x0084 (size: 0x4)
    EAnimSyncMethod __EnumProperty_145;                                               // 0x0088 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_146;                             // 0x0089 (size: 0x1)
    FName __NameProperty_147;                                                         // 0x008C (size: 0x8)
    class UBlendProfile* __BlendProfile_148;                                          // 0x0098 (size: 0x8)
    class UCurveFloat* __CurveFloat_149;                                              // 0x00A0 (size: 0x8)
    bool __BoolProperty_150;                                                          // 0x00A8 (size: 0x1)
    EAlphaBlendOption __EnumProperty_151;                                             // 0x00A9 (size: 0x1)
    EBlendListTransitionType __EnumProperty_152;                                      // 0x00AA (size: 0x1)
    TArray<float> __ArrayProperty_153;                                                // 0x00B0 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_154;                                        // 0x00C0 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00E0 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0160 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0178 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;     // 0x01A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x01D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;      // 0x0208 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x0238 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;      // 0x0268 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot_1;         // 0x0298 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;      // 0x02C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x02F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0328 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0358 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x0388 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x03B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x03E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0418 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x0448 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0478 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x04A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x04D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot;           // 0x0508 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x0538 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0568 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;           // 0x0598 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x05C8 (size: 0x30)

}; // Size: 0x5F8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    bool __BoolProperty_1;                                                            // 0x000C (size: 0x1)
    float __FloatProperty_2;                                                          // 0x0010 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x0014 (size: 0x4)
    bool __BoolProperty_4;                                                            // 0x0018 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0019 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x001A (size: 0x1)
    bool __BoolProperty_7;                                                            // 0x001B (size: 0x1)
    bool __BoolProperty_8;                                                            // 0x001C (size: 0x1)

}; // Size: 0x1D

class UExor_AnimBP_C : public UAbioticCharacterAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x20)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0398 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03A0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03A8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x03C8 (size: 0x70)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0438 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x0480 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x04C8 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x0538 (size: 0x48)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot_1;                              // 0x0580 (size: 0x90)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x0610 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x0658 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x06A0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x06E8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0730 (size: 0xF0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x0820 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x0848 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0870 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x08F0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0938 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x0980 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x09C8 (size: 0x48)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot;                                // 0x0A10 (size: 0x90)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x0AA0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x0AC0 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x0AE0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x0C08 (size: 0x128)
    float Speed;                                                                      // 0x0D30 (size: 0x4)
    float Direction;                                                                  // 0x0D34 (size: 0x4)
    bool InCombat;                                                                    // 0x0D38 (size: 0x1)
    bool Netted;                                                                      // 0x0D39 (size: 0x1)
    bool HeadshotDeath;                                                               // 0x0D3A (size: 0x1)
    class UBlendSpace* CombatBlendspace;                                              // 0x0D40 (size: 0x8)
    class UBlendSpace* IdleBlendspace;                                                // 0x0D48 (size: 0x8)
    FRotator AimRotation;                                                             // 0x0D50 (size: 0x18)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Exor_AnimBP_AnimGraphNode_ModifyBone_34DB1321425A94BD1E2654A47E56D19D();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void ExecuteUbergraph_Exor_AnimBP(int32 EntryPoint);
}; // Size: 0xD68

#endif
