#ifndef UE4SS_SDK_FPArms_AnimBP_HPP
#define UE4SS_SDK_FPArms_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    TArray<float> __ArrayProperty_439;                                                // 0x0008 (size: 0x10)
    TArray<int32> __ArrayProperty_440;                                                // 0x0018 (size: 0x10)
    FName __NameProperty_441;                                                         // 0x0028 (size: 0x8)
    TArray<float> __ArrayProperty_442;                                                // 0x0030 (size: 0x10)
    FName __NameProperty_443;                                                         // 0x0040 (size: 0x8)
    int32 __IntProperty_444;                                                          // 0x0048 (size: 0x4)
    FName __NameProperty_445;                                                         // 0x004C (size: 0x8)
    int32 __IntProperty_446;                                                          // 0x0054 (size: 0x4)
    FName __NameProperty_447;                                                         // 0x0058 (size: 0x8)
    int32 __IntProperty_448;                                                          // 0x0060 (size: 0x4)
    TArray<float> __ArrayProperty_449;                                                // 0x0068 (size: 0x10)
    EAnimSyncMethod __EnumProperty_450;                                               // 0x0078 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_451;                             // 0x0079 (size: 0x1)
    FName __NameProperty_452;                                                         // 0x007C (size: 0x8)
    FName __NameProperty_453;                                                         // 0x0084 (size: 0x8)
    int32 __IntProperty_454;                                                          // 0x008C (size: 0x4)
    FName __NameProperty_455;                                                         // 0x0090 (size: 0x8)
    FName __NameProperty_456;                                                         // 0x0098 (size: 0x8)
    EAlphaBlendOption __EnumProperty_457;                                             // 0x00A0 (size: 0x1)
    TArray<float> __ArrayProperty_458;                                                // 0x00A8 (size: 0x10)
    FInputScaleBiasClampConstants __StructProperty_459;                               // 0x00B8 (size: 0x2C)
    TArray<float> __ArrayProperty_460;                                                // 0x00E8 (size: 0x10)
    EAlphaBlendOption __EnumProperty_461;                                             // 0x00F8 (size: 0x1)
    TArray<float> __ArrayProperty_462;                                                // 0x0100 (size: 0x10)
    float __FloatProperty_463;                                                        // 0x0110 (size: 0x4)
    class UBlendProfile* __BlendProfile_464;                                          // 0x0118 (size: 0x8)
    class UCurveFloat* __CurveFloat_465;                                              // 0x0120 (size: 0x8)
    EAlphaBlendOption __EnumProperty_466;                                             // 0x0128 (size: 0x1)
    EBlendListTransitionType __EnumProperty_467;                                      // 0x0129 (size: 0x1)
    TArray<float> __ArrayProperty_468;                                                // 0x0130 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_469;                                        // 0x0140 (size: 0x20)
    float __FloatProperty_470;                                                        // 0x0160 (size: 0x4)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_471;                        // 0x0164 (size: 0x1)
    bool __BoolProperty_472;                                                          // 0x0165 (size: 0x1)
    int32 __IntProperty_473;                                                          // 0x0168 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_474;                                  // 0x0170 (size: 0x8)
    bool __BoolProperty_475;                                                          // 0x0178 (size: 0x1)
    EAnimSyncMethod __EnumProperty_476;                                               // 0x0179 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_477;                             // 0x017A (size: 0x1)
    FName __NameProperty_478;                                                         // 0x017C (size: 0x8)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0188 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0208 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;        // 0x0220 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;        // 0x0250 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;      // 0x0280 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x02B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;      // 0x02E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_7;      // 0x0310 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_1;     // 0x0340 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;        // 0x0370 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;        // 0x03A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x03D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;      // 0x0400 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;      // 0x0430 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0460 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_6;      // 0x0490 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x04C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x04F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;       // 0x0520 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;       // 0x0550 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;       // 0x0580 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;      // 0x05B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_5;                 // 0x05E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x0610 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x0640 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x0670 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x06A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x06D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x0700 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x0730 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x0760 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x0790 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x07C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x07F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x0820 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_5; // 0x0850 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_5; // 0x0880 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_5;           // 0x08B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;       // 0x08E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x0910 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_4; // 0x0940 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_4; // 0x0970 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_4;           // 0x09A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_4;                 // 0x09D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x0A00 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x0A30 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_3; // 0x0A60 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_3; // 0x0A90 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;           // 0x0AC0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_3;                 // 0x0AF0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x0B20 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x0B50 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_2; // 0x0B80 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_2; // 0x0BB0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;           // 0x0BE0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x0C10 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;      // 0x0C40 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0C70 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0CA0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0CD0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1; // 0x0D00 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1; // 0x0D30 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;           // 0x0D60 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0D90 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0DC0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0DF0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x0E20 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0E50 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;      // 0x0E80 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x0EB0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0EE0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x0F10 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0F40 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x0F70 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x0FA0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0FD0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x1000 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x1030 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;      // 0x1060 (size: 0x30)

}; // Size: 0x1090

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    uint8 __ByteProperty_0;                                                           // 0x0002 (size: 0x1)
    float __FloatProperty_1;                                                          // 0x0004 (size: 0x4)
    bool __BoolProperty_2;                                                            // 0x0008 (size: 0x1)
    float __FloatProperty_3;                                                          // 0x000C (size: 0x4)
    bool __BoolProperty_4;                                                            // 0x0010 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0011 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0012 (size: 0x1)
    bool __BoolProperty_7;                                                            // 0x0013 (size: 0x1)
    bool __BoolProperty_8;                                                            // 0x0014 (size: 0x1)
    float __FloatProperty_9;                                                          // 0x0018 (size: 0x4)
    float __FloatProperty_10;                                                         // 0x001C (size: 0x4)
    bool __BoolProperty_11;                                                           // 0x0020 (size: 0x1)
    float __FloatProperty_12;                                                         // 0x0024 (size: 0x4)

}; // Size: 0x28

class UFPArms_AnimBP_C : public UFPArmsAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x28)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x03A0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03A8 (size: 0x8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x03B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x03D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x0400 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x0448 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x04C8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x0510 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x0558 (size: 0xF0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x0648 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x0670 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x06B8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x06E0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x0728 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0770 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x07F0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0838 (size: 0xF0)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0928 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x0948 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x0990 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x09D8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x0A20 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x0A68 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0AB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0AD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0B00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0B28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0B50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0B78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0BA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x0BC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0BF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0C18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0C40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0C68 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;     // 0x0C90 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;     // 0x0CB0 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0x0CD0 (size: 0x128)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x0DF8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x0E40 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;     // 0x0E60 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;     // 0x0E80 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x0EA0 (size: 0x128)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x0FC8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1010 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x1058 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x1078 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x1098 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x10B8 (size: 0x128)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x11E0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1228 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x1270 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x1290 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x12B0 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x12D0 (size: 0x128)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x13F8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x1440 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x1488 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x14D0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1518 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x1538 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x1558 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x1578 (size: 0x128)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x16A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x16E8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1708 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x17D0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x1818 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x1840 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x1888 (size: 0x128)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x19B0 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x19D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x19F0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x1A38 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x1A80 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1AC8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x1B10 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x1B80 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x1BC8 (size: 0x40)
    bool ViewingWristwatch;                                                           // 0x1C08 (size: 0x1)
    bool Is Sprinting;                                                                // 0x1C09 (size: 0x1)
    bool IsJumping;                                                                   // 0x1C0A (size: 0x1)
    bool IsCrouching;                                                                 // 0x1C0B (size: 0x1)
    class UAnimSequence* FPArms_Walk;                                                 // 0x1C10 (size: 0x8)
    class UAnimSequence* FPArms_Crouch_Walk;                                          // 0x1C18 (size: 0x8)
    class UAnimSequence* FPArms_Sprint;                                               // 0x1C20 (size: 0x8)
    class UAnimSequence* FPArms_Crouch_Idle;                                          // 0x1C28 (size: 0x8)
    class UAnimSequence* FPArms_Idle;                                                 // 0x1C30 (size: 0x8)
    bool IsWalking;                                                                   // 0x1C38 (size: 0x1)
    bool RecentlyPunched;                                                             // 0x1C39 (size: 0x1)
    bool Unarmed;                                                                     // 0x1C3A (size: 0x1)
    class UAnimMontage* FPArms_UseItem;                                               // 0x1C40 (size: 0x8)
    class UAnimMontage* FPArms_Reload;                                                // 0x1C48 (size: 0x8)
    class UAnimMontage* FPArms_BadReload;                                             // 0x1C50 (size: 0x8)
    class UAnimMontage* FPArms_Equip;                                                 // 0x1C58 (size: 0x8)
    class UAnimMontage* FPArms_Stow;                                                  // 0x1C60 (size: 0x8)
    bool Is Plug Placement Mode;                                                      // 0x1C68 (size: 0x1)
    double Speed;                                                                     // 0x1C70 (size: 0x8)
    bool InDeployMode;                                                                // 0x1C78 (size: 0x1)
    bool ShieldBlocking;                                                              // 0x1C79 (size: 0x1)
    bool HasShield;                                                                   // 0x1C7A (size: 0x1)
    bool HasWalkAnim;                                                                 // 0x1C7B (size: 0x1)
    bool RecentlyUsedItem;                                                            // 0x1C7C (size: 0x1)
    bool RecentlyBlocked;                                                             // 0x1C7D (size: 0x1)
    FVector RightArmBlockOffset;                                                      // 0x1C80 (size: 0x18)
    FRotator RightArmBlockRotation;                                                   // 0x1C98 (size: 0x18)
    bool IsDeadDBNO;                                                                  // 0x1CB0 (size: 0x1)
    bool FishMode;                                                                    // 0x1CB1 (size: 0x1)
    double FishXAxis;                                                                 // 0x1CB8 (size: 0x8)
    double FishYAxis;                                                                 // 0x1CC0 (size: 0x8)
    double ReelProgress;                                                              // 0x1CC8 (size: 0x8)
    bool FishingReeling;                                                              // 0x1CD0 (size: 0x1)
    FTransform OffhandIdleTransform;                                                  // 0x1CE0 (size: 0x60)
    FTransform OffhandBlockTransform;                                                 // 0x1D40 (size: 0x60)
    class UAnimSequenceBase* Offhand_Equip;                                           // 0x1DA0 (size: 0x8)
    class UAnimSequenceBase* Offhand_Walk;                                            // 0x1DA8 (size: 0x8)
    class UAnimSequenceBase* Offhand_Idle;                                            // 0x1DB0 (size: 0x8)
    class UAnimSequenceBase* Offhand_Block;                                           // 0x1DB8 (size: 0x8)
    class UAnimSequenceBase* Offhand_BlockHit;                                        // 0x1DC0 (size: 0x8)
    class UAnimSequenceBase* Offhand_Offscreen;                                       // 0x1DC8 (size: 0x8)

    void AnimGraph(FPoseLink& AnimGraph);
    void UpdateWristwatch(class AAbiotic_PlayerCharacter_C* Player);
    void EvaluateFPState();
    void TickFishing(double DeltaTime);
    void LoadAnimationReference(const TSoftObjectPtr<UObject>& SoftObjectReference, bool& Valid, class UObject*& Object);
    void LoadAndSetAnimData(FAbiotic_FPAnimationStruct FPAnimationData);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_SequencePlayer_AB626BED4C9EAE85B618C580207D273E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_SequencePlayer_E42DAF0F4FE0F9A8AD9608B6D2D60161();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_ModifyBone_2F609C5049BBFCC172102E9988C116F5();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_ModifyBone_71BF1AD247F503E76F2EC7B7D5E8A1AA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_BlendListByBool_2148D2384E5860B499F616B0C7ED9568();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_ModifyBone_4232E55949A46B0BAEA59E8CFA0DD8B0();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_ModifyBone_B7ACA42E4E530CC1EE8CB787E03CA72D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_ModifyBone_5609D41B44E746D7F7660094CE67E14B();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void Set_RecentlyPunched();
    void PlayEquipAnim();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_TransitionResult_89342EF84EE9BBDC88DD17B2D289DC64();
    void BlueprintBeginPlay();
    void OnBlockReaction_Event();
    void ExecuteUbergraph_FPArms_AnimBP(int32 EntryPoint);
}; // Size: 0x1DD0

#endif
