#ifndef UE4SS_SDK_FPArms_AnimBP_HPP
#define UE4SS_SDK_FPArms_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_604;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_605;                                                         // 0x000C (size: 0x8)
    FName __NameProperty_606;                                                         // 0x0014 (size: 0x8)
    FName __NameProperty_607;                                                         // 0x001C (size: 0x8)
    FName __NameProperty_608;                                                         // 0x0024 (size: 0x8)
    FName __NameProperty_609;                                                         // 0x002C (size: 0x8)
    FName __NameProperty_610;                                                         // 0x0034 (size: 0x8)
    int32 __IntProperty_611;                                                          // 0x003C (size: 0x4)
    FName __NameProperty_612;                                                         // 0x0040 (size: 0x8)
    int32 __IntProperty_613;                                                          // 0x0048 (size: 0x4)
    FName __NameProperty_614;                                                         // 0x004C (size: 0x8)
    int32 __IntProperty_615;                                                          // 0x0054 (size: 0x4)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_616;                             // 0x0058 (size: 0x1)
    FName __NameProperty_617;                                                         // 0x005C (size: 0x8)
    int32 __IntProperty_618;                                                          // 0x0064 (size: 0x4)
    FName __NameProperty_619;                                                         // 0x0068 (size: 0x8)
    FName __NameProperty_620;                                                         // 0x0070 (size: 0x8)
    EAlphaBlendOption __EnumProperty_621;                                             // 0x0078 (size: 0x1)
    TArray<float> __ArrayProperty_622;                                                // 0x0080 (size: 0x10)
    TArray<float> __ArrayProperty_623;                                                // 0x0090 (size: 0x10)
    TArray<float> __ArrayProperty_624;                                                // 0x00A0 (size: 0x10)
    EAlphaBlendOption __EnumProperty_625;                                             // 0x00B0 (size: 0x1)
    TArray<float> __ArrayProperty_626;                                                // 0x00B8 (size: 0x10)
    int32 __IntProperty_627;                                                          // 0x00C8 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_628;                                  // 0x00D0 (size: 0x8)
    TArray<float> __ArrayProperty_629;                                                // 0x00D8 (size: 0x10)
    TArray<float> __ArrayProperty_630;                                                // 0x00E8 (size: 0x10)
    EAnimSyncMethod __EnumProperty_631;                                               // 0x00F8 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_632;                             // 0x00F9 (size: 0x1)
    FName __NameProperty_633;                                                         // 0x00FC (size: 0x8)
    class UBlendProfile* __BlendProfile_634;                                          // 0x0108 (size: 0x8)
    class UCurveFloat* __CurveFloat_635;                                              // 0x0110 (size: 0x8)
    EAlphaBlendOption __EnumProperty_636;                                             // 0x0118 (size: 0x1)
    EBlendListTransitionType __EnumProperty_637;                                      // 0x0119 (size: 0x1)
    TArray<float> __ArrayProperty_638;                                                // 0x0120 (size: 0x10)
    TArray<int32> __ArrayProperty_639;                                                // 0x0130 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_640;                                        // 0x0140 (size: 0x20)
    bool __BoolProperty_641;                                                          // 0x0160 (size: 0x1)
    float __FloatProperty_642;                                                        // 0x0164 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_643;                               // 0x0168 (size: 0x2C)
    float __FloatProperty_644;                                                        // 0x0194 (size: 0x4)
    bool __BoolProperty_645;                                                          // 0x0198 (size: 0x1)
    EAnimSyncMethod __EnumProperty_646;                                               // 0x0199 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_647;                             // 0x019A (size: 0x1)
    FName __NameProperty_648;                                                         // 0x019C (size: 0x8)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x01A8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0228 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;        // 0x0240 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;        // 0x0270 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer;        // 0x02A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_17;    // 0x02D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;    // 0x0300 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;    // 0x0330 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;    // 0x0360 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;    // 0x0390 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_20;      // 0x03C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;          // 0x03F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;    // 0x0420 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_19;      // 0x0450 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;          // 0x0480 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_18;      // 0x04B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;          // 0x04E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;         // 0x0510 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;      // 0x0540 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;      // 0x0570 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x05A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_1;      // 0x05D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_8;      // 0x0600 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;      // 0x0630 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;      // 0x0660 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_1;     // 0x0690 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                 // 0x06C0 (size: 0x30)
    FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose;                       // 0x06F0 (size: 0x8)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x06F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;      // 0x0728 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;      // 0x0758 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_7;      // 0x0788 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_5;                 // 0x07B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x07E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x0818 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x0848 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x0878 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x08A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x08D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x0908 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x0938 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x0968 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x0998 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x09C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x09F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_5; // 0x0A28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_5; // 0x0A58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_5;           // 0x0A88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;      // 0x0AB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x0AE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_4; // 0x0B18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_4; // 0x0B48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_4;           // 0x0B78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_4;                 // 0x0BA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;      // 0x0BD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x0C08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_3; // 0x0C38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_3; // 0x0C68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;           // 0x0C98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_3;                 // 0x0CC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;       // 0x0CF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x0D28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_2; // 0x0D58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_2; // 0x0D88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;           // 0x0DB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x0DE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_6;      // 0x0E18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;       // 0x0E48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;       // 0x0E78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0EA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1; // 0x0ED8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1; // 0x0F08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;           // 0x0F38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;       // 0x0F68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0F98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0FC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x0FF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;        // 0x1028 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;      // 0x1058 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x1088 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x10B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x10E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x1118 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;      // 0x1148 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;      // 0x1178 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x11A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x11D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x1208 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;      // 0x1238 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x1268 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x1298 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x12C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x12F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x1328 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x1358 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x1388 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x13B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x13E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x1418 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;        // 0x1448 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x1478 (size: 0x30)

}; // Size: 0x14A8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    float __FloatProperty_1;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0008 (size: 0x4)
    bool __BoolProperty_3;                                                            // 0x000C (size: 0x1)
    bool __BoolProperty_4;                                                            // 0x000D (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x000E (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x000F (size: 0x1)
    bool __BoolProperty_7;                                                            // 0x0010 (size: 0x1)
    float __FloatProperty_8;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x0018 (size: 0x4)
    bool __BoolProperty_10;                                                           // 0x001C (size: 0x1)
    float __FloatProperty_11;                                                         // 0x0020 (size: 0x4)
    bool __BoolProperty_12;                                                           // 0x0024 (size: 0x1)
    bool __BoolProperty_13;                                                           // 0x0025 (size: 0x1)
    float __FloatProperty_14;                                                         // 0x0028 (size: 0x4)
    float __FloatProperty_15;                                                         // 0x002C (size: 0x4)
    uint8 __ByteProperty_16;                                                          // 0x0030 (size: 0x1)

}; // Size: 0x31

class UFPArms_AnimBP_C : public UFPArmsAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x34)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x03B0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03B8 (size: 0x8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x03C0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x03E8 (size: 0x28)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0x0410 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x04D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0500 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0528 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0578 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x05A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x05E8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0608 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x0630 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x0678 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x0698 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x06E0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x0700 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x07C8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x0810 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x0858 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x08D8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x0920 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x0968 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x09B0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x09F8 (size: 0xF0)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x0AE8 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x0B08 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0BC0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x0BE0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x0C28 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x0C70 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x0CB8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0D00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0D28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0D50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0D78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0DA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0DC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0DF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x0E18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0E40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0E68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0E90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0EB8 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;     // 0x0EE0 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;     // 0x0F00 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0x0F20 (size: 0x128)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x1048 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x1090 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;     // 0x10B0 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;     // 0x10D0 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x10F0 (size: 0x128)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x1218 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x1260 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x12A8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x12C8 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x12E8 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x1308 (size: 0x128)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x1430 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x1478 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x14C0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x14E0 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x1500 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x1520 (size: 0x128)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x1648 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x1690 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x16D8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x1720 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1768 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x1788 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x17A8 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x17C8 (size: 0x128)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x18F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x1938 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1958 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x1A20 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x1A68 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x1A90 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x1AD8 (size: 0x128)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x1C00 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x1C20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1C40 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x1C88 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x1CD0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1D18 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x1D60 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x1DD0 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x1E18 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x1E58 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x1EA0 (size: 0xF0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x1F90 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1FD8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x2020 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x20A0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x20C8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x20F0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x2138 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x2180 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x21C8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x2210 (size: 0x48)
    bool ViewingWristwatch;                                                           // 0x2258 (size: 0x1)
    bool Is Sprinting;                                                                // 0x2259 (size: 0x1)
    bool IsJumping;                                                                   // 0x225A (size: 0x1)
    bool IsCrouching;                                                                 // 0x225B (size: 0x1)
    class UAnimSequence* FPArms_Walk;                                                 // 0x2260 (size: 0x8)
    class UAnimSequence* FPArms_Crouch_Walk;                                          // 0x2268 (size: 0x8)
    class UAnimSequence* FPArms_Sprint;                                               // 0x2270 (size: 0x8)
    class UAnimSequence* FPArms_Crouch_Idle;                                          // 0x2278 (size: 0x8)
    class UAnimSequence* FPArms_Idle;                                                 // 0x2280 (size: 0x8)
    class UAnimSequence* FPArms_AltIdle;                                              // 0x2288 (size: 0x8)
    class UAnimSequence* FPArms_AltWalk;                                              // 0x2290 (size: 0x8)
    class UAnimSequence* FPArms_AltCrouchIdle;                                        // 0x2298 (size: 0x8)
    class UAnimSequence* FPArms_AltCrouchWalk;                                        // 0x22A0 (size: 0x8)
    bool IsWalking;                                                                   // 0x22A8 (size: 0x1)
    bool RecentlyPunched;                                                             // 0x22A9 (size: 0x1)
    bool Unarmed;                                                                     // 0x22AA (size: 0x1)
    class UAnimMontage* FPArms_UseItem;                                               // 0x22B0 (size: 0x8)
    class UAnimMontage* FPArms_Reload;                                                // 0x22B8 (size: 0x8)
    class UAnimMontage* FPArms_BadReload;                                             // 0x22C0 (size: 0x8)
    class UAnimMontage* FPArms_Equip;                                                 // 0x22C8 (size: 0x8)
    class UAnimMontage* FPArms_Stow;                                                  // 0x22D0 (size: 0x8)
    bool Is Plug Placement Mode;                                                      // 0x22D8 (size: 0x1)
    double Speed;                                                                     // 0x22E0 (size: 0x8)
    bool InDeployMode;                                                                // 0x22E8 (size: 0x1)
    bool ShieldBlocking;                                                              // 0x22E9 (size: 0x1)
    bool HasShield;                                                                   // 0x22EA (size: 0x1)
    bool HasWalkAnim;                                                                 // 0x22EB (size: 0x1)
    bool RecentlyUsedItem;                                                            // 0x22EC (size: 0x1)
    bool RecentlyBlocked;                                                             // 0x22ED (size: 0x1)
    FVector RightArmBlockOffset;                                                      // 0x22F0 (size: 0x18)
    FRotator RightArmBlockRotation;                                                   // 0x2308 (size: 0x18)
    bool IsDeadDBNO;                                                                  // 0x2320 (size: 0x1)
    bool FishMode;                                                                    // 0x2321 (size: 0x1)
    double FishXAxis;                                                                 // 0x2328 (size: 0x8)
    double FishYAxis;                                                                 // 0x2330 (size: 0x8)
    double ReelProgress;                                                              // 0x2338 (size: 0x8)
    bool FishingReeling;                                                              // 0x2340 (size: 0x1)
    FTransform OffhandIdleTransform;                                                  // 0x2350 (size: 0x60)
    FTransform OffhandBlockTransform;                                                 // 0x23B0 (size: 0x60)
    class UAnimSequenceBase* Offhand_Equip;                                           // 0x2410 (size: 0x8)
    class UAnimSequenceBase* Offhand_Walk;                                            // 0x2418 (size: 0x8)
    class UAnimSequenceBase* Offhand_Idle;                                            // 0x2420 (size: 0x8)
    class UAnimSequenceBase* Offhand_Block;                                           // 0x2428 (size: 0x8)
    class UAnimSequenceBase* Offhand_BlockHit;                                        // 0x2430 (size: 0x8)
    class UAnimSequenceBase* Offhand_Offscreen;                                       // 0x2438 (size: 0x8)
    bool AltAnimState;                                                                // 0x2440 (size: 0x1)
    class UAnimSequenceBase* WatchOpenAnim;                                           // 0x2448 (size: 0x8)
    class UAnimSequenceBase* WatchCloseAnim;                                          // 0x2450 (size: 0x8)
    class UAnimSequenceBase* WatchIdleAnim;                                           // 0x2458 (size: 0x8)
    float WristwatchEndDelayTim;                                                      // 0x2460 (size: 0x4)
    FTimerHandle WristwatchEndTimer;                                                  // 0x2468 (size: 0x8)
    bool WantToViewWristwatch;                                                        // 0x2470 (size: 0x1)

    void ItemArms(FPoseLink InPose, FPoseLink& ItemArms);
    void AnimGraph(FPoseLink& AnimGraph);
    void UpdateWristwatch(class AAbiotic_PlayerCharacter_C* Player);
    void EvaluateFPState();
    void TickFishing(double DeltaTime);
    void LoadAnimationReference(const TSoftObjectPtr<UObject>& SoftObjectReference, bool& Valid, class UObject*& Object);
    void LoadAndSetAnimData(FAbiotic_FPAnimationStruct FPAnimationData);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_TransitionResult_E10E4CBD4131F9A4AA742CBB905BBE14();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_TransitionResult_758B324548D33454F40E5997F286D910();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_SequencePlayer_30896D9B4152FE04F2FB9684EB3EA6E9();
