#ifndef UE4SS_SDK_FPArms_AnimBP_HPP
#define UE4SS_SDK_FPArms_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    TArray<float> __ArrayProperty_393;                                                // 0x0008 (size: 0x10)
    TArray<int32> __ArrayProperty_394;                                                // 0x0018 (size: 0x10)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_395;                        // 0x0028 (size: 0x1)
    class UAnimSequenceBase* __AnimSequenceBase_396;                                  // 0x0030 (size: 0x8)
    FName __NameProperty_397;                                                         // 0x0038 (size: 0x8)
    EAlphaBlendOption __EnumProperty_398;                                             // 0x0040 (size: 0x1)
    TArray<float> __ArrayProperty_399;                                                // 0x0048 (size: 0x10)
    TArray<float> __ArrayProperty_400;                                                // 0x0058 (size: 0x10)
    FName __NameProperty_401;                                                         // 0x0068 (size: 0x8)
    int32 __IntProperty_402;                                                          // 0x0070 (size: 0x4)
    FName __NameProperty_403;                                                         // 0x0074 (size: 0x8)
    int32 __IntProperty_404;                                                          // 0x007C (size: 0x4)
    FName __NameProperty_405;                                                         // 0x0080 (size: 0x8)
    int32 __IntProperty_406;                                                          // 0x0088 (size: 0x4)
    TArray<float> __ArrayProperty_407;                                                // 0x0090 (size: 0x10)
    EAnimSyncMethod __EnumProperty_408;                                               // 0x00A0 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_409;                             // 0x00A1 (size: 0x1)
    FName __NameProperty_410;                                                         // 0x00A4 (size: 0x8)
    bool __BoolProperty_411;                                                          // 0x00AC (size: 0x1)
    FName __NameProperty_412;                                                         // 0x00B0 (size: 0x8)
    int32 __IntProperty_413;                                                          // 0x00B8 (size: 0x4)
    FName __NameProperty_414;                                                         // 0x00BC (size: 0x8)
    FName __NameProperty_415;                                                         // 0x00C4 (size: 0x8)
    int32 __IntProperty_416;                                                          // 0x00CC (size: 0x4)
    EAlphaBlendOption __EnumProperty_417;                                             // 0x00D0 (size: 0x1)
    TArray<float> __ArrayProperty_418;                                                // 0x00D8 (size: 0x10)
    float __FloatProperty_419;                                                        // 0x00E8 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_420;                               // 0x00EC (size: 0x2C)
    float __FloatProperty_421;                                                        // 0x0118 (size: 0x4)
    EAnimSyncMethod __EnumProperty_422;                                               // 0x011C (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_423;                             // 0x011D (size: 0x1)
    FName __NameProperty_424;                                                         // 0x0120 (size: 0x8)
    TArray<float> __ArrayProperty_425;                                                // 0x0128 (size: 0x10)
    class UBlendProfile* __BlendProfile_426;                                          // 0x0138 (size: 0x8)
    class UCurveFloat* __CurveFloat_427;                                              // 0x0140 (size: 0x8)
    bool __BoolProperty_428;                                                          // 0x0148 (size: 0x1)
    EAlphaBlendOption __EnumProperty_429;                                             // 0x0149 (size: 0x1)
    EBlendListTransitionType __EnumProperty_430;                                      // 0x014A (size: 0x1)
    TArray<float> __ArrayProperty_431;                                                // 0x0150 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_432;                                        // 0x0160 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0180 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0200 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;        // 0x0218 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;      // 0x0248 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;      // 0x0278 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;      // 0x02A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;        // 0x02D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x0308 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;       // 0x0338 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;       // 0x0368 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;       // 0x0398 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;      // 0x03C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x03F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_6;      // 0x0428 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x0458 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0488 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;      // 0x04B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x04E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;      // 0x0518 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_4;                 // 0x0548 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x0578 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x05A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x05D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x0608 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x0638 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x0668 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x0698 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x06C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x06F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x0728 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x0758 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x0788 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_4; // 0x07B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_4; // 0x07E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_4;           // 0x0818 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;       // 0x0848 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x0878 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x08A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x08D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_3; // 0x0908 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_3; // 0x0938 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;           // 0x0968 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_3;                 // 0x0998 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x09C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x09F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_2; // 0x0A28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_2; // 0x0A58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;           // 0x0A88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x0AB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;      // 0x0AE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0B18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0B48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0B78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1; // 0x0BA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1; // 0x0BD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;           // 0x0C08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0C38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0C68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0C98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x0CC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0CF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x0D28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x0D58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0D88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x0DB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0DE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x0E18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x0E48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0E78 (size: 0x30)

}; // Size: 0xEA8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    float __FloatProperty_0;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_2;                                                          // 0x000C (size: 0x4)
    bool __BoolProperty_3;                                                            // 0x0010 (size: 0x1)
    bool __BoolProperty_4;                                                            // 0x0011 (size: 0x1)
    float __FloatProperty_5;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_6;                                                          // 0x0018 (size: 0x4)
    bool __BoolProperty_7;                                                            // 0x001C (size: 0x1)
    bool __BoolProperty_8;                                                            // 0x001D (size: 0x1)
    bool __BoolProperty_9;                                                            // 0x001E (size: 0x1)
    bool __BoolProperty_10;                                                           // 0x001F (size: 0x1)
    bool __BoolProperty_11;                                                           // 0x0020 (size: 0x1)

}; // Size: 0x21

class UFPArms_AnimBP_C : public UFPArmsAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x24)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x03A0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03A8 (size: 0x8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x03B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x03F8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x0440 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x0488 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x04D0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x04F8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x0520 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x0568 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x05B0 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x05F8 (size: 0x40)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0638 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x06B8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0700 (size: 0xF0)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x07F0 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x0810 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x0858 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x08C8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x0910 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0958 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0980 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x09A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x09D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x09F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0A20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0A48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x0A70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0A98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0AC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0AE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0B10 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;     // 0x0B38 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;     // 0x0B58 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x0B78 (size: 0x128)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x0CA0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x0CE8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x0D08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x0D50 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x0D70 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x0D90 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x0DB0 (size: 0x128)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0ED8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0F20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x0F68 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x0F88 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x0FA8 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x0FC8 (size: 0x128)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x10F0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x1138 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x1180 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x11C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1210 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x1230 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x1250 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x1270 (size: 0x128)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x1398 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x13E0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1400 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x14C8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x1510 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x1538 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x1580 (size: 0x128)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x16A8 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x16C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x16E8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x1730 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x1778 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x17C0 (size: 0x48)
    bool ViewingWristwatch;                                                           // 0x1808 (size: 0x1)
    bool Is Sprinting;                                                                // 0x1809 (size: 0x1)
    bool IsJumping;                                                                   // 0x180A (size: 0x1)
    bool IsCrouching;                                                                 // 0x180B (size: 0x1)
    class UAnimSequence* FPArms_Walk;                                                 // 0x1810 (size: 0x8)
    class UAnimSequence* FPArms_Crouch_Walk;                                          // 0x1818 (size: 0x8)
    class UAnimSequence* FPArms_Sprint;                                               // 0x1820 (size: 0x8)
    class UAnimSequence* FPArms_Crouch_Idle;                                          // 0x1828 (size: 0x8)
    class UAnimSequence* FPArms_Idle;                                                 // 0x1830 (size: 0x8)
    bool IsWalking;                                                                   // 0x1838 (size: 0x1)
    bool RecentlyPunched;                                                             // 0x1839 (size: 0x1)
    bool Unarmed;                                                                     // 0x183A (size: 0x1)
    class UAnimMontage* FPArms_UseItem;                                               // 0x1840 (size: 0x8)
    class UAnimMontage* FPArms_Reload;                                                // 0x1848 (size: 0x8)
    class UAnimMontage* FPArms_BadReload;                                             // 0x1850 (size: 0x8)
    class UAnimMontage* FPArms_Equip;                                                 // 0x1858 (size: 0x8)
    class UAnimMontage* FPArms_Stow;                                                  // 0x1860 (size: 0x8)
    bool Is Plug Placement Mode;                                                      // 0x1868 (size: 0x1)
    double Speed;                                                                     // 0x1870 (size: 0x8)
    bool InDeployMode;                                                                // 0x1878 (size: 0x1)
    bool ShieldBlocking;                                                              // 0x1879 (size: 0x1)
    bool HasShield;                                                                   // 0x187A (size: 0x1)
    bool HasWalkAnim;                                                                 // 0x187B (size: 0x1)
    bool RecentlyUsedItem;                                                            // 0x187C (size: 0x1)
    bool RecentlyBlocked;                                                             // 0x187D (size: 0x1)
    FVector RightArmBlockOffset;                                                      // 0x1880 (size: 0x18)
    FRotator RightArmBlockRotation;                                                   // 0x1898 (size: 0x18)
    bool IsDeadDBNO;                                                                  // 0x18B0 (size: 0x1)
    class UAnimSequenceBase* ShieldBlockAnim;                                         // 0x18B8 (size: 0x8)
    class UAnimSequenceBase* ShieldBlockHitAnim;                                      // 0x18C0 (size: 0x8)
    bool FishMode;                                                                    // 0x18C8 (size: 0x1)
    double FishXAxis;                                                                 // 0x18D0 (size: 0x8)
    double FishYAxis;                                                                 // 0x18D8 (size: 0x8)
    double ReelProgress;                                                              // 0x18E0 (size: 0x8)
    bool FishingReeling;                                                              // 0x18E8 (size: 0x1)
    FTransform ShieldIdleTransform;                                                   // 0x18F0 (size: 0x60)
    FTransform ShieldBlockTransform;                                                  // 0x1950 (size: 0x60)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateFPState();
    void TickFishing(double DeltaTime);
    void LoadAnimationReference(const TSoftObjectPtr<UObject>& SoftObjectReference, bool& Valid, class UObject*& Object);
    void LoadAndSetAnimData(FAbiotic_FPAnimationStruct FPAnimationData);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_SequencePlayer_AB626BED4C9EAE85B618C580207D273E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_SequencePlayer_E42DAF0F4FE0F9A8AD9608B6D2D60161();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_ModifyBone_2F609C5049BBFCC172102E9988C116F5();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_ModifyBone_71BF1AD247F503E76F2EC7B7D5E8A1AA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_BlendListByBool_2148D2384E5860B499F616B0C7ED9568();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_ModifyBone_4232E55949A46B0BAEA59E8CFA0DD8B0();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_ModifyBone_5609D41B44E746D7F7660094CE67E14B();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void Set_RecentlyPunched();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPArms_AnimBP_AnimGraphNode_TransitionResult_89342EF84EE9BBDC88DD17B2D289DC64();
    void PlayEquipAnim();
    void BlueprintBeginPlay();
    void OnBlockReaction_Event();
    void ExecuteUbergraph_FPArms_AnimBP(int32 EntryPoint);
}; // Size: 0x19B0

#endif
