#ifndef UE4SS_SDK_GardenPlot_Large_HPP
#define UE4SS_SDK_GardenPlot_Large_HPP

class AGardenPlot_Large_C : public AGardenPlot_ParentBP_C
{
    class UChildActorComponent* Plot8;                                                // 0x09A8 (size: 0x8)
    class UChildActorComponent* Plot7;                                                // 0x09B0 (size: 0x8)
    class UChildActorComponent* Plot6;                                                // 0x09B8 (size: 0x8)
    class UChildActorComponent* Plot5;                                                // 0x09C0 (size: 0x8)
    class UChildActorComponent* Plot4;                                                // 0x09C8 (size: 0x8)
    class UChildActorComponent* Plot3;                                                // 0x09D0 (size: 0x8)
    class UChildActorComponent* Plot2;                                                // 0x09D8 (size: 0x8)
    class UChildActorComponent* Plot1;                                                // 0x09E0 (size: 0x8)

}; // Size: 0x9E8

#endif
