#ifndef UE4SS_SDK_GardenPlot_Large_HPP
#define UE4SS_SDK_GardenPlot_Large_HPP

class AGardenPlot_Large_C : public AGardenPlot_ParentBP_C
{
    class UChildActorComponent* Plot8;                                                // 0x0A58 (size: 0x8)
    class UChildActorComponent* Plot7;                                                // 0x0A60 (size: 0x8)
    class UChildActorComponent* Plot6;                                                // 0x0A68 (size: 0x8)
    class UChildActorComponent* Plot5;                                                // 0x0A70 (size: 0x8)
    class UChildActorComponent* Plot4;                                                // 0x0A78 (size: 0x8)
    class UChildActorComponent* Plot3;                                                // 0x0A80 (size: 0x8)
    class UChildActorComponent* Plot2;                                                // 0x0A88 (size: 0x8)
    class UChildActorComponent* Plot1;                                                // 0x0A90 (size: 0x8)

}; // Size: 0xA98

#endif
