#ifndef UE4SS_SDK_LevelMetadata_Struct_HPP
#define UE4SS_SDK_LevelMetadata_Struct_HPP

struct FLevelMetadata_Struct
{
    EReleaseGroup ReleaseGroup_20_111881DD49BCE06B31F20780CAC09223;                   // 0x0000 (size: 0x1)
    FName LevelFileName_4_4189631446EDDBE4B5EAE69952F1577C;                           // 0x0004 (size: 0x8)
    FDataTableRowHandle LevelFXRow_Day_9_730F761F48B9E958F8502BB10C47C998;            // 0x0010 (size: 0x10)
    FDataTableRowHandle LevelFXRow_Night_8_0062E3FB47C3AD2FA814B988D9F37B33;          // 0x0020 (size: 0x10)
    FText SectorName_13_6D7367C44F16A1C849E2EA9A512F6777;                             // 0x0030 (size: 0x10)
    bool ResettablePortalWorld_17_A659D3914286BC7EF9F48A91F94DF901;                   // 0x0040 (size: 0x1)
    bool HasFacilityShakes_22_502FB08F4709B6E77A4C38888B81C87C;                       // 0x0041 (size: 0x1)
    bool IsVignette_24_2C59FABF4FD2F51E062A6796CCE089E7;                              // 0x0042 (size: 0x1)
    FName EntranceTeleporter_27_F0895895499D0F0E1F0BDBB347641DB8;                     // 0x0044 (size: 0x8)

}; // Size: 0x4C

#endif
