#ifndef UE4SS_SDK_NPC_Coworker_AnimBP_HPP
#define UE4SS_SDK_NPC_Coworker_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_203;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_204;                                                         // 0x000C (size: 0x8)
    int32 __IntProperty_205;                                                          // 0x0014 (size: 0x4)
    FName __NameProperty_206;                                                         // 0x0018 (size: 0x8)
    FName __NameProperty_207;                                                         // 0x0020 (size: 0x8)
    int32 __IntProperty_208;                                                          // 0x0028 (size: 0x4)
    bool __BoolProperty_209;                                                          // 0x002C (size: 0x1)
    TArray<float> __ArrayProperty_210;                                                // 0x0030 (size: 0x10)
    TArray<float> __ArrayProperty_211;                                                // 0x0040 (size: 0x10)
    TArray<float> __ArrayProperty_212;                                                // 0x0050 (size: 0x10)
    float __FloatProperty_213;                                                        // 0x0060 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_214;                               // 0x0064 (size: 0x2C)
    float __FloatProperty_215;                                                        // 0x0090 (size: 0x4)
    EAnimSyncMethod __EnumProperty_216;                                               // 0x0094 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_217;                             // 0x0095 (size: 0x1)
    FName __NameProperty_218;                                                         // 0x0098 (size: 0x8)
    FAnimNodeFunctionRef __StructProperty_219;                                        // 0x00A0 (size: 0x20)
    class UBlendProfile* __BlendProfile_220;                                          // 0x00C0 (size: 0x8)
    class UCurveFloat* __CurveFloat_221;                                              // 0x00C8 (size: 0x8)
    bool __BoolProperty_222;                                                          // 0x00D0 (size: 0x1)
    EAlphaBlendOption __EnumProperty_223;                                             // 0x00D1 (size: 0x1)
    EBlendListTransitionType __EnumProperty_224;                                      // 0x00D2 (size: 0x1)
    TArray<float> __ArrayProperty_225;                                                // 0x00D8 (size: 0x10)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00E8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0168 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0180 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x01B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x01E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x0210 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x0240 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x0270 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x02A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x02D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x0300 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0330 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x0360 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0390 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x03C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x03F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x0420 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0450 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1; // 0x0480 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1; // 0x04B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt;                 // 0x04E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;           // 0x0510 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0540 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0570 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;      // 0x05A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;      // 0x05D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0600 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0630 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot;           // 0x0660 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x0690 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x06C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x06F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0720 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x0750 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0780 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x07B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x07E0 (size: 0x30)

}; // Size: 0x810

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0010 (size: 0x4)
    bool __BoolProperty_3;                                                            // 0x0014 (size: 0x1)
    bool __BoolProperty_4;                                                            // 0x0015 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0016 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0017 (size: 0x1)
    bool __BoolProperty_7;                                                            // 0x0018 (size: 0x1)

}; // Size: 0x19

class UNPC_Coworker_AnimBP_C : public UAbioticCharacterAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x1C)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0398 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03A0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03A8 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x03C8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0410 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x0458 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x04D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x0500 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0548 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0570 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x0598 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x0608 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0628 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x0670 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x0690 (size: 0xC8)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x0758 (size: 0x118)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0870 (size: 0xF0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x0960 (size: 0x48)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x09A8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x09C8 (size: 0x20)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x09F0 (size: 0x250)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x0C40 (size: 0x128)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0D68 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x0DE8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x0E10 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x0E58 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0EA0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0EE8 (size: 0x48)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot;                                // 0x0F30 (size: 0x90)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x0FC0 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x1008 (size: 0x128)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x1130 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x1150 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x1170 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x11B8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1200 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x1248 (size: 0x48)
    double Time;                                                                      // 0x1290 (size: 0x8)
    bool Is Dead;                                                                     // 0x1298 (size: 0x1)
    double Speed;                                                                     // 0x12A0 (size: 0x8)
    bool Unarmed;                                                                     // 0x12A8 (size: 0x1)
    class UAimOffsetBlendSpace* AimSpace_UpperBody;                                   // 0x12B0 (size: 0x8)
    class UAnimSequence* AimSpace_BasePose;                                           // 0x12B8 (size: 0x8)
    bool RecentlyPunched;                                                             // 0x12C0 (size: 0x1)
    bool RightFootLast;                                                               // 0x12C1 (size: 0x1)
    double Yaw;                                                                       // 0x12C8 (size: 0x8)
    double Pitch;                                                                     // 0x12D0 (size: 0x8)
    FVector LookAtLocation;                                                           // 0x12D8 (size: 0x18)
    float SpeakingAlpha;                                                              // 0x12F0 (size: 0x4)
    FRotator SpeakingJawMax;                                                          // 0x12F8 (size: 0x18)
    float FootfallTraceDistance;                                                      // 0x1310 (size: 0x4)
    class AAbiotic_Character_ParentBP_C* CharacterParent;                             // 0x1318 (size: 0x8)
    bool Eating;                                                                      // 0x1320 (size: 0x1)
    bool Grabbed;                                                                     // 0x1321 (size: 0x1)
    double HeadExplodedAlpha;                                                         // 0x1328 (size: 0x8)
    float Direction;                                                                  // 0x1330 (size: 0x4)
    bool SittingInSeat;                                                               // 0x1334 (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_NPC_Coworker_AnimBP_AnimGraphNode_LookAt_1C6D9DD74063CAB432834FAD6C64F8EC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_NPC_Coworker_AnimBP_AnimGraphNode_LayeredBoneBlend_C5EFBDE842D89E1B75DF7E99128BFB89();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void AnimNotify_Footfall_Left();
    void AnimNotify_Footfall_Right();
    void AnimNotify_GrabStart();
    void AnimNotify_GrabEnd();
    void ExecuteUbergraph_NPC_Coworker_AnimBP(int32 EntryPoint);
}; // Size: 0x1335

#endif
