#ifndef UE4SS_SDK_NPC_Coworker_AnimBP_HPP
#define UE4SS_SDK_NPC_Coworker_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_181;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_182;                                                         // 0x000C (size: 0x8)
    int32 __IntProperty_183;                                                          // 0x0014 (size: 0x4)
    FName __NameProperty_184;                                                         // 0x0018 (size: 0x8)
    FName __NameProperty_185;                                                         // 0x0020 (size: 0x8)
    int32 __IntProperty_186;                                                          // 0x0028 (size: 0x4)
    bool __BoolProperty_187;                                                          // 0x002C (size: 0x1)
    TArray<float> __ArrayProperty_188;                                                // 0x0030 (size: 0x10)
    TArray<float> __ArrayProperty_189;                                                // 0x0040 (size: 0x10)
    float __FloatProperty_190;                                                        // 0x0050 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_191;                               // 0x0054 (size: 0x2C)
    float __FloatProperty_192;                                                        // 0x0080 (size: 0x4)
    EAnimSyncMethod __EnumProperty_193;                                               // 0x0084 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_194;                             // 0x0085 (size: 0x1)
    FName __NameProperty_195;                                                         // 0x0088 (size: 0x8)
    TArray<float> __ArrayProperty_196;                                                // 0x0090 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_197;                                        // 0x00A0 (size: 0x20)
    class UBlendProfile* __BlendProfile_198;                                          // 0x00C0 (size: 0x8)
    class UCurveFloat* __CurveFloat_199;                                              // 0x00C8 (size: 0x8)
    bool __BoolProperty_200;                                                          // 0x00D0 (size: 0x1)
    EAlphaBlendOption __EnumProperty_201;                                             // 0x00D1 (size: 0x1)
    EBlendListTransitionType __EnumProperty_202;                                      // 0x00D2 (size: 0x1)
    TArray<float> __ArrayProperty_203;                                                // 0x00D8 (size: 0x10)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00E8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0168 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0180 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x01B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x01E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x0210 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x0240 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0270 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x02A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x02D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x0300 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0330 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x0360 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0390 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x03C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace; // 0x03F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x0420 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0450 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1; // 0x0480 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1; // 0x04B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt;                 // 0x04E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;           // 0x0510 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0540 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0570 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;      // 0x05A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x05D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x0600 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0630 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0660 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot;           // 0x0690 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x06C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x06F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x0720 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0750 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x0780 (size: 0x30)

}; // Size: 0x7B0

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0010 (size: 0x4)
    bool __BoolProperty_3;                                                            // 0x0014 (size: 0x1)
    bool __BoolProperty_4;                                                            // 0x0015 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0016 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0017 (size: 0x1)

}; // Size: 0x18

class UNPC_Coworker_AnimBP_C : public UAbioticCharacterAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x18)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0390 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0398 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03A0 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x03C0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0408 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x0450 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x04D0 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x04F8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0540 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0568 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x0590 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x0600 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0620 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x0668 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x0688 (size: 0xC8)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x0750 (size: 0x118)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0868 (size: 0xF0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x0958 (size: 0x48)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x09A0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x09C0 (size: 0x20)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x09E0 (size: 0x250)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x0C30 (size: 0x128)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0D58 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x0DD8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x0E00 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0E48 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x0E90 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0ED8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x0F20 (size: 0x48)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot;                                // 0x0F68 (size: 0x90)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x0FF8 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x1040 (size: 0x128)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x1168 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x1188 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x11A8 (size: 0x48)
    double Time;                                                                      // 0x11F0 (size: 0x8)
    bool Is Dead;                                                                     // 0x11F8 (size: 0x1)
    double Speed;                                                                     // 0x1200 (size: 0x8)
    bool Unarmed;                                                                     // 0x1208 (size: 0x1)
    class UAimOffsetBlendSpace* AimSpace_UpperBody;                                   // 0x1210 (size: 0x8)
    class UAnimSequence* AimSpace_BasePose;                                           // 0x1218 (size: 0x8)
    bool RecentlyPunched;                                                             // 0x1220 (size: 0x1)
    bool RightFootLast;                                                               // 0x1221 (size: 0x1)
    double Yaw;                                                                       // 0x1228 (size: 0x8)
    double Pitch;                                                                     // 0x1230 (size: 0x8)
    FVector LookAtLocation;                                                           // 0x1238 (size: 0x18)
    float SpeakingAlpha;                                                              // 0x1250 (size: 0x4)
    FRotator SpeakingJawMax;                                                          // 0x1258 (size: 0x18)
    float FootfallTraceDistance;                                                      // 0x1270 (size: 0x4)
    class AAbiotic_Character_ParentBP_C* CharacterParent;                             // 0x1278 (size: 0x8)
    bool Eating;                                                                      // 0x1280 (size: 0x1)
    bool Grabbed;                                                                     // 0x1281 (size: 0x1)
    double HeadExplodedAlpha;                                                         // 0x1288 (size: 0x8)
    float Direction;                                                                  // 0x1290 (size: 0x4)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_NPC_Coworker_AnimBP_AnimGraphNode_LookAt_1C6D9DD74063CAB432834FAD6C64F8EC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_NPC_Coworker_AnimBP_AnimGraphNode_LayeredBoneBlend_C5EFBDE842D89E1B75DF7E99128BFB89();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void AnimNotify_Footfall_Left();
    void AnimNotify_Footfall_Right();
    void AnimNotify_GrabStart();
    void AnimNotify_GrabEnd();
    void ExecuteUbergraph_NPC_Coworker_AnimBP(int32 EntryPoint);
}; // Size: 0x1294

#endif
