#ifndef UE4SS_SDK_SaveData_GlobalUnlocks_Struct_HPP
#define UE4SS_SDK_SaveData_GlobalUnlocks_Struct_HPP

struct FSaveData_GlobalUnlocks_Struct
{
    TSet<FName> GlobalRecipesUnlocked_43_AA99AF994766F5556796A89F89EF7645;            // 0x0000 (size: 0x50)
    TSet<FName> GlobalRecipesResearched_44_1AC051E9407AF4F01F9F19A62C5CE01E;          // 0x0050 (size: 0x50)
    TArray<FName> GlobalItemsPickedUp_32_0D99146044C3330A30A4C4AB8980DAF4;            // 0x00A0 (size: 0x10)
    TArray<FName> GlobalEmailsRead_34_0A562D184DBED267F898E6A3128557B4;               // 0x00B0 (size: 0x10)
    TArray<FName> GlobalJournalEntries_36_0AB6A0E444B128E28D0741917389C897;           // 0x00C0 (size: 0x10)
    TArray<FName> GlobalCompendiumEmail_38_181999554462F3D8CD3BC7AEF1037A2D;          // 0x00D0 (size: 0x10)
    TArray<FName> GlobalCompendiumNarrative_40_EEBC4619442FF6008D8282A684063892;      // 0x00E0 (size: 0x10)
    TArray<FName> GlobalCompendiumExploration_42_D35947E2407A37D800A2538AB82EDEA5;    // 0x00F0 (size: 0x10)
    FString ActiveLeyakContainmentID_48_759AE779473F27DD9483AAB34D22A795;             // 0x0100 (size: 0x10)

}; // Size: 0x110

#endif
