#ifndef UE4SS_SDK_SK_Squid_Skeleton_AnimBlueprint_HPP
#define UE4SS_SDK_SK_Squid_Skeleton_AnimBlueprint_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_124;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_125;                                                         // 0x000C (size: 0x8)
    TArray<float> __ArrayProperty_126;                                                // 0x0018 (size: 0x10)
    TArray<float> __ArrayProperty_127;                                                // 0x0028 (size: 0x10)
    TArray<float> __ArrayProperty_128;                                                // 0x0038 (size: 0x10)
    TArray<float> __ArrayProperty_129;                                                // 0x0048 (size: 0x10)
    class UBlendProfile* __BlendProfile_130;                                          // 0x0058 (size: 0x8)
    class UCurveFloat* __CurveFloat_131;                                              // 0x0060 (size: 0x8)
    EAlphaBlendOption __EnumProperty_132;                                             // 0x0068 (size: 0x1)
    EBlendListTransitionType __EnumProperty_133;                                      // 0x0069 (size: 0x1)
    TArray<float> __ArrayProperty_134;                                                // 0x0070 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_135;                                        // 0x0080 (size: 0x20)
    bool __BoolProperty_136;                                                          // 0x00A0 (size: 0x1)
    float __FloatProperty_137;                                                        // 0x00A4 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_138;                               // 0x00A8 (size: 0x2C)
    float __FloatProperty_139;                                                        // 0x00D4 (size: 0x4)
    bool __BoolProperty_140;                                                          // 0x00D8 (size: 0x1)
    EAnimSyncMethod __EnumProperty_141;                                               // 0x00D9 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_142;                             // 0x00DA (size: 0x1)
    FName __NameProperty_143;                                                         // 0x00DC (size: 0x8)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00E8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0168 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x0180 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x01B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;     // 0x01E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;      // 0x0210 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x0240 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot_1;         // 0x0270 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;      // 0x02A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x02D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0300 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x0330 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0360 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x0390 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1; // 0x03C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1; // 0x03F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0420 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x0450 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x0480 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot;           // 0x04B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x04E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics;           // 0x0510 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x0540 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0570 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x05A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x05D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0600 (size: 0x30)

}; // Size: 0x630

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    bool __BoolProperty_0;                                                            // 0x0008 (size: 0x1)
    bool __BoolProperty_1;                                                            // 0x0009 (size: 0x1)
    bool __BoolProperty_2;                                                            // 0x000A (size: 0x1)
    bool __BoolProperty_3;                                                            // 0x000B (size: 0x1)
    float __FloatProperty_4;                                                          // 0x000C (size: 0x4)
    bool __BoolProperty_5;                                                            // 0x0010 (size: 0x1)

}; // Size: 0x11

class USK_Squid_Skeleton_AnimBlueprint_C : public UAbioticCharacterAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0378 (size: 0x14)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0390 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0398 (size: 0x8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x03A0 (size: 0xF0)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0490 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x04B0 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x0520 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0568 (size: 0x48)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot_1;                              // 0x05B0 (size: 0x90)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x0640 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0688 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x06D0 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x0750 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x0778 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x07A0 (size: 0x128)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x08C8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x08E8 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x0908 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x0950 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x0998 (size: 0x48)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot;                                // 0x09E0 (size: 0x90)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0A70 (size: 0x48)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics;                                // 0x0AC0 (size: 0x520)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x0FE0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x1000 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x1020 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x1090 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x10D8 (size: 0x48)
    bool K2Node_PropertyAccess_4;                                                     // 0x1120 (size: 0x1)
    TEnumAsByte<E_NettedStates::Type> K2Node_PropertyAccess_3;                        // 0x1121 (size: 0x1)
    bool K2Node_PropertyAccess_2;                                                     // 0x1122 (size: 0x1)
    FVector K2Node_PropertyAccess_1;                                                  // 0x1128 (size: 0x18)
    bool K2Node_PropertyAccess;                                                       // 0x1140 (size: 0x1)
    double Speed;                                                                     // 0x1148 (size: 0x8)
    bool IsInCombat;                                                                  // 0x1150 (size: 0x1)
    bool Netted;                                                                      // 0x1151 (size: 0x1)
    bool IsDBNO;                                                                      // 0x1152 (size: 0x1)
    bool RightFootLast;                                                               // 0x1153 (size: 0x1)
    FVector Wobble;                                                                   // 0x1158 (size: 0x18)
    class ANPC_Skink_Basic_C* SkinkNPC;                                               // 0x1170 (size: 0x8)

    void AnimGraph(FPoseLink& AnimGraph);
    void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void AnimNotify_Footfall_Left();
    void AnimNotify_Footfall_Right();
    void BlueprintBeginPlay();
    void ExecuteUbergraph_SK_Squid_Skeleton_AnimBlueprint(int32 EntryPoint);
}; // Size: 0x1178

#endif
