#ifndef UE4SS_SDK_WaypointData_Struct_HPP
#define UE4SS_SDK_WaypointData_Struct_HPP

struct FWaypointData_Struct
{
    TSoftObjectPtr<UTexture2D> Icon_5_076D8A1A4C0BCA912A3FB4A61D9E5DCA;               // 0x0000 (size: 0x28)
    bool DisplayText_6_5D7DDCD94DF582D8A18D4083C73368E0;                              // 0x0028 (size: 0x1)
    FText TextToShow_9_F4FB09A94188FB1FDEA18FBA60356C89;                              // 0x0030 (size: 0x10)
    bool ShowProgressBar_12_699C993647E1E3F57B33BF86BD826650;                         // 0x0040 (size: 0x1)
    FLinearColor IconColor_17_E554053B44E66BB132D0B0A2A9B3D5B3;                       // 0x0044 (size: 0x10)
    FLinearColor ProgressBarFillColor_18_A9E530324C6B5EA8729BC28F8BC2FBC5;            // 0x0054 (size: 0x10)
    FLinearColor TextColor_21_79CC7735439CA3A01C4FC2A71485B262;                       // 0x0064 (size: 0x10)
    double RenderScale_24_EFE4A9234D7983973238128C256D2140;                           // 0x0078 (size: 0x8)

}; // Size: 0x80

#endif
